[{"checkname": "accessAnalyzerActiveFindings", "title": "Access Analyzer Active Findings", "severity": "High", "description": "Ensure that IAM Access analyzer findings are reviewed and resolved by taking all necessary actions.", "more_info": "", "service": "accessanalyzer"}, {"checkname": "accessAnalyzerEnabled", "title": "Access Analyzer Enabled", "severity": "Medium", "description": "Ensure that IAM Access analyzer is enabled for all regions.", "more_info": "Access Analyzer allow you to determine if an unintended user is allowed, making it easier for administrators to monitor least privileges access. It analyzes only policies that are applied to resources in the same AWS region.", "service": "accessanalyzer"}, {"checkname": "acmCertificateExpiry", "title": "ACM Certificate Expiry", "severity": "High", "description": "Detect upcoming expiration of ACM certificates", "more_info": "Certificates that have expired will trigger warnings in all major browsers. AWS will attempt to automatically renew the certificate but may be unable to do so if email or DNS validation cannot be confirmed.", "service": "acm"}, {"checkname": "acmCertificateHasTags", "title": "ACM Certificate Has Tags", "severity": "Low", "description": "Ensure that ACM Certificates have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "acm"}, {"checkname": "acmSingleDomainNameCertificate", "title": "ACM Single Domain Name Certificates", "severity": "Low", "description": "Ensure that ACM single domain name certificates are used instead of wildcard certificates within your AWS account.", "more_info": "Using wildcard certificates can compromise the security of all sites i.e. domains and subdomains if the private key of a certificate is hacked. So it is recommended to use ACM single domain name certificates instead of wildcard certificates.", "service": "acm"}, {"checkname": "acmValidation", "title": "ACM Certificate Validation", "severity": "Medium", "description": "ACM certificates should be configured to use DNS validation.", "more_info": "With DNS validation, ACM will automatically renew certificates before they expire, as long as the DNS CNAME record is in place.", "service": "acm"}, {"checkname": "apiStageLevelCacheEncryption", "title": "API Stage-Level Cache Encryption", "severity": "High", "description": "Ensure that your Amazon API Gateway REST APIs are configured to encrypt API cached responses.", "more_info": "It is strongly recommended to enforce encryption for API cached responses in order to protect your data from unauthorized access.", "service": "apigateway"}, {"checkname": "apigatewayAuthorization", "title": "API Gateway Authorization", "severity": "High", "description": "Ensures that Amazon API Gateway APIs are using authorizer", "more_info": "API Gateway API should be using authorizer to enforce security measures and control access to API resources.", "service": "apigateway"}, {"checkname": "apigatewayCertificateRotation", "title": "API Gateway Certificate Rotation", "severity": "High", "description": "Ensures that Amazon API Gateway APIs have certificates with expiration date more than the rotation limit.", "more_info": "API Gateway APIs should have certificates with long term expiry date to avoid API insecurity after certificate expiration.", "service": "apigateway"}, {"checkname": "apigatewayClientCertificate", "title": "API Gateway Client Certificate", "severity": "Medium", "description": "Ensures that Amazon API Gateway API stages use client certificates.", "more_info": "API Gateway API stages should use client certificates to ensure API security authorization.", "service": "apigateway"}, {"checkname": "apigatewayCloudwatchLogs", "title": "API Gateway CloudWatch Logs", "severity": "Medium", "description": "Ensures that Amazon API Gateway API stages have Amazon CloudWatch Logs enabled.", "more_info": "API Gateway API stages should have Amazon CloudWatch Logs enabled to help debug issues related to request execution or client access to your API.", "service": "apigateway"}, {"checkname": "apigatewayContentEncoding", "title": "API Gateway Content Encoding", "severity": "Medium", "description": "Ensures that Amazon API Gateway APIs have content encoding enabled.", "more_info": "API Gateway API should have content encoding enabled to enable compression of response payload.", "service": "apigateway"}, {"checkname": "apigatewayDefaultEndpointDisabled", "title": "API Gateway Default Endpoint Disabled", "severity": "High", "description": "Ensure default execute-api endpoint is disabled for your API Gateway.", "more_info": "By default, clients can invoke your API by using the execute-api endpoint that API Gateway generates for your API. To ensure that clients can access your API only by using a custom domain name, disable the default execute-api endpoint.", "service": "apigateway"}, {"checkname": "apigatewayPrivateEndpoints", "title": "API Gateway Private Endpoints", "severity": "High", "description": "Ensures that Amazon API Gateway APIs are only accessible through private endpoints.", "more_info": "API Gateway APIs should be only accessible through private endpoints to ensure API security.", "service": "apigateway"}, {"checkname": "apigatewayResponseCaching", "title": "API Gateway Response Caching", "severity": "Medium", "description": "Ensure that response caching is enabled for your Amazon API Gateway REST APIs.", "more_info": "", "service": "apigateway"}, {"checkname": "apigatewayTracingEnabled", "title": "API Gateway Tracing Enabled", "severity": "Low", "description": "Ensures that Amazon API Gateway API stages have tracing enabled for AWS X-Ray.", "more_info": "API Gateway API stages should have tracing enabled to send traces to AWS X-Ray for enhanced distributed tracing.", "service": "apigateway"}, {"checkname": "apigatewayWafEnabled", "title": "API Gateway WAF Enabled", "severity": "Medium", "description": "Ensures that API Gateway APIs are associated with a Web Application Firewall.", "more_info": "API Gateway APIs should be associated with a Web Application Firewall to ensure API security.", "service": "apigateway"}, {"checkname": "customDomainTlsVersion", "title": "Custom Domain TLS Version", "severity": "High", "description": "Ensure API Gateway custom domains are using current minimum TLS version.", "more_info": "A security policy is a predefined combination of minimum TLS version and cipher suite offered by Amazon API Gateway. Choose either a TLS version 1.2 or TLS version 1.0 security policy.", "service": "apigateway"}, {"checkname": "detailedCloudWatchMetrics", "title": "API Gateway Detailed CloudWatch Metrics", "severity": "Medium", "description": "Ensures that API Gateway API stages have detailed CloudWatch metrics enabled.", "more_info": "API Gateway API stages should have detailed CloudWatch metrics enabled to monitor logs and events.", "service": "apigateway"}, {"checkname": "flowEncrypted", "title": "AppFlow Flow Encrypted", "severity": "High", "description": "Ensure that your Amazon AppFlow flows are encrypted with desired encryption level.", "more_info": "", "service": "appflow"}, {"checkname": "appmeshTLSRequired", "title": "App Mesh TLS Required", "severity": "High", "description": "Ensure that AWS App Mesh virtual gateway listeners only accepts TLS enabled connections.", "more_info": "In App Mesh, Transport Layer Security (TLS) encrypts communication between the envoy proxies deployed on compute resources that are represented in App Mesh by mesh endpoints, such as Virtual nodes and Virtual gateways.", "service": "appmesh"}, {"checkname": "appmeshVGAccessLogging", "title": "App Mesh VG Access Logging", "severity": "Medium", "description": "Ensure that your Amazon App Mesh virtual gateways have access logging enabled.", "more_info": "Enabling access logging feature for App Mesh virtual gateways lets you track application mesh user access, helps you meet compliance regulations, and gives insight into security audits and investigations. ", "service": "appmesh"}, {"checkname": "appmeshVGHealthChecks", "title": "App Mesh VG Health Check Policies", "severity": "Medium", "description": "Ensure that Amazon App Mesh virtual gateways use health check policies to monitor the availability of virtual nodes.", "more_info": "Health check policies in App Mesh are essential to maintain application availability and reliability by monitoring the health of associated virtual nodes.", "service": "appmesh"}, {"checkname": "restrictExternalTraffic", "title": "App Mesh Restrict External Traffic", "severity": "Medium", "description": "Ensure that Amazon App Mesh virtual nodes have egress only access to other defined resources available within the service mesh.", "more_info": "", "service": "appmesh"}, {"checkname": "serviceEncrypted", "title": "Service Encrypted", "severity": "High", "description": "Ensure that AWS App Runner service is encrypted using desired encryption level.", "more_info": "", "service": "apprunner"}, {"checkname": "workgroupEncrypted", "title": "Workgroup Encrypted", "severity": "High", "description": "Ensures Athena workgroups are configured to encrypt all data at rest.", "more_info": "Athena workgroups support full server-side encryption for all data at rest which should be enabled.", "service": "athena"}, {"checkname": "workgroupEnforceConfiguration", "title": "Workgroup Enforce Configuration", "severity": "Medium", "description": "Ensures Athena workgroups do not allow clients to override configuration options.", "more_info": "Athena workgroups support the ability for clients to override configuration options, including encryption requirements. This setting should be disabled to enforce encryption mandates.", "service": "athena"}, {"checkname": "auditmanagerDataEncrypted", "title": "Audit Manager Data Encrypted", "severity": "High", "description": "Ensure that all data in Audit Manager is encrypted with desired encryption level.", "more_info": "", "service": "auditmanager"}, {"checkname": "appTierAsgApprovedAmi", "title": "App-Tier ASG Launch Configurations Approved AMIs", "severity": "Medium", "description": "Ensures that App-Tier Auto Scaling Group Launch Configurations are using approved AMIs.", "more_info": "App-Tier Auto Scaling Group Launch Configurations should use approved AMIs only to launch EC2 instances within the ASG", "service": "autoscaling"}, {"checkname": "appTierAsgCloudwatchLogs", "title": "App-Tier Auto Scaling Group CloudWatch Logs Enabled", "severity": "Medium", "description": "Ensures that App-Tier Auto Scaling Groups are using CloudWatch logs agent.", "more_info": "EC2 instance available within app-tier Auto Scaling Group (ASG) should use an AWS CloudWatch Logs agent to monitor, store and access log files.", "service": "autoscaling"}, {"checkname": "appTierIamRole", "title": "App-Tier Launch Configurations IAM Roles", "severity": "Medium", "description": "Ensures that App-Tier Auto Scaling launch configuration is configured to use a customer created IAM role.", "more_info": "App-Tier Auto Scaling launch configuration should have a customer created App-Tier IAM role to provide necessary credentials to access AWS services.", "service": "autoscaling"}, {"checkname": "asgActiveNotifications", "title": "Auto Scaling Notifications Active", "severity": "Medium", "description": "Ensures auto scaling groups have notifications active.", "more_info": "Notifications can be sent to an SNS endpoint when scaling actions occur, which should be set to ensure all scaling activity is recorded.", "service": "autoscaling"}, {"checkname": "asgCooldownPeriod", "title": "Auto Scaling Group Cooldown Period", "severity": "High", "description": "Ensure that your AWS Auto Scaling Groups are configured to use a cool down period.", "more_info": "A scaling cool down helps you prevent your Auto Scaling group from launching or terminating additional instances before the effects of previous activities are visible.", "service": "autoscaling"}, {"checkname": "asgMissingELB", "title": "Auto Scaling Group Missing ELB", "severity": "High", "description": "Ensures all Auto Scaling groups are referencing active load balancers.", "more_info": "Each Auto Scaling group with a load balancer configured should reference an active ELB.", "service": "autoscaling"}, {"checkname": "asgMissingSecurityGroups", "title": "Launch Configuration Referencing Missing Security Groups", "severity": "Medium", "description": "Ensures that Auto Scaling launch configurations are not utilizing missing security groups.", "more_info": "Auto Scaling launch configuration should utilize an active security group to ensure safety of managed instances.", "service": "autoscaling"}, {"checkname": "asgMultiAz", "title": "ASG Multiple AZ", "severity": "Medium", "description": "Ensures that ASGs are created to be cross-AZ for high availability.", "more_info": "ASGs can easily be configured to allow instances to launch in multiple availability zones. This ensures that the ASG can continue to scale, even when AWS is experiencing downtime in one or more zones.", "service": "autoscaling"}, {"checkname": "asgSuspendedProcesses", "title": "Suspended AutoScaling Groups", "severity": "Medium", "description": "Ensures that there are no Amazon AutoScaling groups with suspended processes.", "more_info": "AutoScaling groups should not have any suspended processes to avoid disrupting the AutoScaling workflow.", "service": "autoscaling"}, {"checkname": "asgUnusedLaunchConfiguration", "title": "Auto Scaling Unused Launch Configuration", "severity": "Low", "description": "Ensure that any unused Auto Scaling Launch Configuration templates are identified and removed from your account in order to adhere to AWS best practices.", "more_info": "", "service": "autoscaling"}, {"checkname": "elbHealthCheckActive", "title": "ELB Health Check Active", "severity": "Medium", "description": "Ensures all Auto Scaling groups have ELB health check active.", "more_info": "Auto Scaling groups should have ELB health checks active to replace unhealthy instances in time.", "service": "autoscaling"}, {"checkname": "emptyASG", "title": "Empty AutoScaling Group", "severity": "Low", "description": "Ensures all autoscaling groups contain at least 1 instance.", "more_info": "AutoScaling groups that are no longer in use should be deleted to prevent accidental use.", "service": "autoscaling"}, {"checkname": "sameAzElb", "title": "AutoScaling ELB Same Availability Zone", "severity": "High", "description": "Ensures all autoscaling groups with attached ELBs are operating in the same availability zone.", "more_info": "To work properly and prevent orphaned instances, ELBs must be created in the same availability zones as the backend instances in the autoscaling group.", "service": "autoscaling"}, {"checkname": "webTierAsgApprovedAmi", "title": "Web-Tier ASG Launch Configurations Approved AMIs", "severity": "High", "description": "Ensures that Web-Tier Auto Scaling Group Launch Configurations are using approved AMIs.", "more_info": "Web-Tier Auto Scaling Group Launch Configurations should use approved AMIs only to launch EC2 instances within the ASG", "service": "autoscaling"}, {"checkname": "webTierAsgAssociatedElb", "title": "Web-Tier Auto Scaling Group Associated ELB", "severity": "High", "description": "Ensures that Web-Tier Auto Scaling Group has an associated Elastic Load Balancer", "more_info": "Web-Tier Auto Scaling groups should have an ELB associated to distribute incoming traffic across EC2 instances.", "service": "autoscaling"}, {"checkname": "webTierAsgCloudwatchLogs", "title": "Web-Tier Auto Scaling Group CloudWatch Logs Enabled", "severity": "Medium", "description": "Ensures that Web-Tier Auto Scaling Groups are using CloudWatch Logs agent.", "more_info": "EC2 instance available within web-tier Auto Scaling Group (ASG) should use an AWS CloudWatch Logs agent to monitor, store and access log files.", "service": "autoscaling"}, {"checkname": "webTierIamRole", "title": "Web-Tier Launch Configurations IAM Roles", "severity": "Medium", "description": "Ensures that Web-Tier Auto Scaling launch configuration is configured to use a customer created IAM role.", "more_info": "Web-Tier Auto Scaling launch configuration should have a customer created Web-Tier IAM role to provide necessary credentials to access AWS services.", "service": "autoscaling"}, {"checkname": "backupDeletionProtection", "title": "Backup Deletion Protection Enabled", "severity": "High", "description": "Ensure that an Amazon Backup vault access policy is configured to prevent the deletion of AWS backups in the backup vault.", "more_info": "With AWS Backup, you can assign policies to backup vaults and the resources they contain. Assigning policies allows you to do things like grant access to users to create backup plans and on-demand backups, but limit their ability to delete recovery points after they are created.", "service": "backup"}, {"checkname": "backupInUseForRDSSnapshots", "title": "Backup In Use For RDS Snapshots", "severity": "Low", "description": "Ensure that Amazon Backup is integrated with Amazon Relational Database Service in order to manage RDS database instance snapshots", "more_info": "Amazon RDS creates and saves automated backups of your DB instance during the backup window of your DB instance. With Amazon Backup, you can centrally configure backup policies and rules, and monitor backup activity for AWS RDS database instances.", "service": "backup"}, {"checkname": "backupNotificationEnabled", "title": "Backup Failure Notification Enabled", "severity": "Low", "description": "Ensure that Amazon Backup vaults send notifications via Amazon SNS for each failed backup job event.", "more_info": "AWS Backup can take advantage of the robust notifications delivered by Amazon Simple Notification Service (Amazon SNS). You can configure Amazon SNS to notify you of AWS Backup events from the Amazon SNS console.", "service": "backup"}, {"checkname": "backupResourceProtection", "title": "Backup Resource Protection", "severity": "Low", "description": "Ensure that protected resource types feature is enabled and configured for Amazon Backup service within.", "more_info": "Amazon Backup protected resource types feature allows you to choose which resource types are protected by backup plans on per-region basis.", "service": "backup"}, {"checkname": "backupVaultEncrypted", "title": "Backup Vault Encrypted", "severity": "High", "description": "Ensure that your Amazon Backup vaults are using AWS KMS Customer Master Keys instead of AWS managed-keys (i.e. default encryption keys).", "more_info": "When you encrypt AWS Backup using your own AWS KMS Customer Master Keys (CMKs) for enhanced protection, you have full control over who can use the encryption keys to access your backups.", "service": "backup"}, {"checkname": "backupVaultHasTags", "title": "Backup Vault Has Tags", "severity": "Low", "description": "Ensure that AWS Backup Vaults have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "backup"}, {"checkname": "backupVaultPolicies", "title": "Backup Vault Policies", "severity": "High", "description": "Ensures Backup Vault policies are properly scoped with specific permissions.", "more_info": "Policies attached to Backup Vault should be scoped to least-privileged access and avoid the use of wildcards.", "service": "backup"}, {"checkname": "compliantLifecycleConfigured", "title": "AWS Backup Compliant Lifecycle Configured", "severity": "Medium", "description": "Ensure that a compliant lifecycle configuration is enabled for your Amazon Backup plans in order to meet compliance requirements when it comes to security and cost optimization.", "more_info": "The AWS Backup lifecycle configuration contains an array of transition objects specifying how long in days before a recovery point transitions to cold storage or is deleted.", "service": "backup"}, {"checkname": "customModelEncryptionEnabled", "title": "Custom Model Encryption Enabled", "severity": "High", "description": "Ensure that an Amazon Bedrock custom models are encrypted with desired encryption level.", "more_info": "When you encrypt AWS Bedrock custom model using your own AWS Customer Managed Keys (CMKs) for enhanced protection, you have full control over who can use the encryption keys to access your custom model.", "service": "bedrock"}, {"checkname": "customModelHasTags", "title": "Custom Model Has Tags", "severity": "Low", "description": "Ensures that Bedrock Custom model has tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "bedrock"}, {"checkname": "customModelInVpc", "title": "Custom Model In VPC", "severity": "Low", "description": "Ensure that an Amazon Bedrock custom model is configured with a VPC.", "more_info": "When the custom model is configured within a VPC, it establishes a secure environment that prevents unauthorized internet access to your training data, enhancing the overall security and confidentiality of your model.", "service": "bedrock"}, {"checkname": "modelInvocationLoggingEnabled", "title": "Bedrock Model Invocation Logging Enabled", "severity": "Low", "description": "Ensure that Amazon Bedrock model invocation logging is enabled.", "more_info": "With invocation logging enabled, you can collect the full request data, response data, and metadata associated with all calls performed in account. This detailed logging provides valuable insights into model usage patterns, helps in troubleshooting, and enhances security by allowing for thorough analysis of model interactions. It also facilitates compliance with auditing requirements, offering a comprehensive record of model invocations.", "service": "bedrock"}, {"checkname": "privateCustomModel", "title": "Private Custom Model", "severity": "Medium", "description": "Ensure that an Amazon Bedrock custom model is configured within a private VPC.", "more_info": "When the custom model is configured within a private VPC or with a private VPC endpoint, it enhances security by restricting access to authorized networks only, preventing exposure to the public internet.", "service": "bedrock"}, {"checkname": "cloudformationAdminPriviliges", "title": "CloudFormation Admin Priviliges", "severity": "Medium", "description": "Ensures no AWS CloudFormation stacks available in your AWS account has admin privileges.", "more_info": "A service role is an AWS Identity and Access Management (IAM) role that allows AWS CloudFormation to make calls to resources in a stack on your behalf. You can specify an IAM role that allows AWS CloudFormation to create, update, or delete your stack resources", "service": "cloudformation"}, {"checkname": "cloudformationDeletionPolicy", "title": "CloudFormation Deletion Policy In Use", "severity": "Medium", "description": "Ensures that deletion policy is used for Amazon CloudFormation stacks.", "more_info": "DeletionPolicy attribute allows to preserve and backup a resource when its stack is deleted. By default, AWS CloudFormation deletes the resource and all its content if a resource has no DeletionPolicy attribute in a template.", "service": "cloudformation"}, {"checkname": "cloudformationInUse", "title": "AWS CloudFormation In Use", "severity": "Low", "description": "Ensure that Amazon CloudFormation service is in use within your AWS account to automate your infrastructure management and deployment.", "more_info": "", "service": "cloudformation"}, {"checkname": "driftDetection", "title": "CloudFormation Drift Detection", "severity": "Medium", "description": "Ensures that AWS CloudFormation stacks are not in a drifted state.", "more_info": "AWS CloudFormation stack should not be in drifted state to ensure that stack template is aligned with the resources.", "service": "cloudformation"}, {"checkname": "plainTextParameters", "title": "CloudFormation Plaintext Parameters", "severity": "Medium", "description": "Ensures CloudFormation parameters that reference sensitive values are configured to use NoEcho.", "more_info": "CloudFormation supports the NoEcho property for sensitive values, which should be used to ensure secrets are not exposed in the CloudFormation UI and APIs.", "service": "cloudformation"}, {"checkname": "stackFailedStatus", "title": "CloudFormation Stack Failed Status", "severity": "Medium", "description": "Ensures that AWS CloudFormation stacks are not in Failed mode for more than the maximum failure limit hours.", "more_info": "AWS CloudFormation stacks should not be in failed mode to avoid application downtime.", "service": "cloudformation"}, {"checkname": "stackNotifications", "title": "CloudFormation Stack SNS Notifications", "severity": "Medium", "description": "Ensures that AWS CloudFormation stacks have SNS topic associated.", "more_info": "AWS CloudFormation stacks should have SNS topic associated to ensure stack events monitoring.", "service": "cloudformation"}, {"checkname": "stackTerminationProtection", "title": "CloudFormation Stack Termination Protection Enabled", "severity": "Medium", "description": "Ensures that AWS CloudFormation stacks have termination protection enabled.", "more_info": "AWS CloudFormation stacks should have termination protection enabled to avoid accidental stack deletion.", "service": "cloudformation"}, {"checkname": "cloudfrontCustomOriginHttpsOnly", "title": "CloudFront Custom Origin HTTPS Only", "severity": "Medium", "description": "Ensures CloudFront Distribution Custom Origin is HTTPS Only.", "more_info": "When you create a distribution, you specify the origin where CloudFront sends requests for the files. You can use several different kinds of origins with CloudFront.", "service": "cloudfront"}, {"checkname": "cloudfrontFieldLevelEncryption", "title": "CloudFront Distribution Field-Level Encryption", "severity": "Medium", "description": "Ensure that field-level encryption is enabled for your Amazon CloudFront web distributions.", "more_info": "", "service": "cloudfront"}, {"checkname": "cloudfrontGeoRestriction", "title": "CloudFront Geo Restriction", "severity": "Medium", "description": "Ensure that geo-restriction feature is enabled for your CloudFront distribution to allow or block location-based access.", "more_info": "", "service": "cloudfront"}, {"checkname": "cloudfrontHttpsOnly", "title": "CloudFront HTTPS Only", "severity": "Medium", "description": "Ensures CloudFront distributions are configured to redirect non-HTTPS traffic to HTTPS.", "more_info": "For maximum security, CloudFront distributions can be configured to only accept HTTPS connections or to redirect HTTP connections to HTTPS.", "service": "cloudfront"}, {"checkname": "cloudfrontInUse", "title": "CloudFront Enabled", "severity": "Low", "description": "Ensure that AWS CloudFront service is used within your AWS account.", "more_info": "Amazon CloudFront is a web service that speeds up distribution of your static and dynamic web content, such as .html, .css, .js, and image files, to your users. CloudFront delivers your content through a worldwide network of data centers called edge locations.", "service": "cloudfront"}, {"checkname": "cloudfrontLoggingEnabled", "title": "CloudFront Logging Enabled", "severity": "Medium", "description": "Ensures CloudFront distributions have request logging enabled.", "more_info": "", "service": "cloudfront"}, {"checkname": "cloudfrontOriginTlsVersion", "title": "CloudFront Distribution Origins TLS Version", "severity": "Medium", "description": "Ensures CloudFront Distribution custom origin TLS version is not deprecated.", "more_info": "The TLS (Transport Layer Security) protocol secures transmission of data over the internet using standard encryption technology. Encryption should be set with the latest version of TLS where possible.", "service": "cloudfront"}, {"checkname": "cloudfrontTlsDeprecatedProtocols", "title": "CloudFront TLS Deprecated Protocols", "severity": "Medium", "description": "Ensures AWS CloudFront distribution is not using deprecated TLS Version.", "more_info": "Use latest TLS policy for CloudFront distribution to meet compliance and regulatory requirements within your organisation and to adhere to AWS security best policies.", "service": "cloudfront"}, {"checkname": "cloudfrontTlsInsecureCipher", "title": "CloudFront TLS Insecure Cipher", "severity": "Medium", "description": "Ensures CloudFront distribution TLS Version is not using insecure cipher.", "more_info": "The TLS (Transport Layer Security) protocol secures transmission of data over the internet using standard encryption technology. Encryption should be set with the latest version of TLS where possible.", "service": "cloudfront"}, {"checkname": "cloudfrontWafEnabled", "title": "CloudFront WAF Enabled", "severity": "Medium", "description": "Ensures CloudFront distributions have WAF enabled.", "more_info": "Enabling WAF allows control over requests to the CloudFront Distribution, allowing or denying traffic based off rules in the Web ACL", "service": "cloudfront"}, {"checkname": "compressObjectsAutomatically", "title": "CloudFront Compress Objects Automatically", "severity": "Low", "description": "Ensure that your Amazon CloudFront distributions are configured to automatically compress files(object).", "more_info": "", "service": "cloudfront"}, {"checkname": "enableOriginFailOver", "title": "CloudFront Enable Origin Failover", "severity": "High", "description": "Ensure that Origin Failover feature is enabled for your CloudFront distributions in order to improve the availability of the content delivered to your end users.", "more_info": "", "service": "cloudfront"}, {"checkname": "insecureProtocols", "title": "Insecure CloudFront Protocols", "severity": "Medium", "description": "Detects the use of insecure HTTPS SSL/TLS protocols for use with HTTPS traffic between viewers and CloudFront", "more_info": "CloudFront supports SSLv3 and TLSv1 protocols for use with HTTPS traffic, but only TLSv1.1 or higher should be used unless there is a valid business justification to support the older, insecure SSLv3.", "service": "cloudfront"}, {"checkname": "publicS3Origin", "title": "Public S3 CloudFront Origin", "severity": "High", "description": "Detects the use of an S3 bucket as a CloudFront origin without an origin access identity", "more_info": "When S3 is used as an origin for a CloudFront bucket, the contents should be kept private and an origin access identity should allow CloudFront access. This prevents someone from bypassing the caching benefits that CloudFront provides, repeatedly loading objects directly from S3, and amassing a large access bill.", "service": "cloudfront"}, {"checkname": "secureOrigin", "title": "Secure CloudFront Origin", "severity": "Medium", "description": "Detects the use of secure web origins with secure protocols for CloudFront.", "more_info": "Traffic passed between the CloudFront edge nodes and the backend resource should be sent over HTTPS with modern protocols for all web-based origins.", "service": "cloudfront"}, {"checkname": "cloudtrailBucketAccessLogging", "title": "CloudTrail Bucket Access Logging", "severity": "Medium", "description": "Ensures CloudTrail logging bucket has access logging enabled to detect tampering of log files", "more_info": "CloudTrail buckets should utilize access logging for an additional layer of auditing. If the log files are deleted or modified in any way, the additional access logs can help determine who made the changes.", "service": "cloudtrail"}, {"checkname": "cloudtrailBucketDelete", "title": "CloudTrail Bucket Delete Policy", "severity": "Medium", "description": "Ensures CloudTrail logging bucket has a policy to prevent deletion of logs without an MFA token", "more_info": "To provide additional security, CloudTrail logging buckets should require an MFA token to delete objects", "service": "cloudtrail"}, {"checkname": "cloudtrailBucketPrivate", "title": "CloudTrail Bucket Private", "severity": "High", "description": "Ensures CloudTrail logging bucket is not publicly accessible", "more_info": "CloudTrail buckets contain large amounts of sensitive account data and should only be accessible by logged in users.", "service": "cloudtrail"}, {"checkname": "cloudtrailDataEvents", "title": "CloudTrail Data Events", "severity": "Low", "description": "Ensure Data events are included into Amazon CloudTrail trails configuration.", "more_info": "AWS CloudTrail trails should be configured to enable Data Events in order to log S3 object-level API operations.", "service": "cloudtrail"}, {"checkname": "cloudtrailDeliveryFailing", "title": "CloudTrail Delivery Failing", "severity": "Medium", "description": "Ensures that Amazon CloudTrail trail log files are delivered to destination S3 bucket.", "more_info": "Amazon CloudTrail trail logs should be delivered to destination S3 bucket to be used for security audits.", "service": "cloudtrail"}, {"checkname": "cloudtrailEnabled", "title": "CloudTrail Enabled", "severity": "High", "description": "Ensures CloudTrail is enabled for all regions within an account", "more_info": "CloudTrail should be enabled for all regions in order to detect suspicious activity in regions that are not typically used.", "service": "cloudtrail"}, {"checkname": "cloudtrailEncryption", "title": "CloudTrail Encryption", "severity": "High", "description": "Ensures CloudTrail encryption at rest is enabled for logs", "more_info": "CloudTrail log files contain sensitive information about an account and should be encrypted at rest for additional protection.", "service": "cloudtrail"}, {"checkname": "cloudtrailFileValidation", "title": "CloudTrail File Validation", "severity": "Medium", "description": "Ensures CloudTrail file validation is enabled for all regions within an account", "more_info": "CloudTrail file validation is essentially a hash of the file which can be used to ensure its integrity in the case of an account compromise.", "service": "cloudtrail"}, {"checkname": "cloudtrailHasTags", "title": "CloudTrail Has Tags", "severity": "Low", "description": "Ensure that AWS CloudTrail trails have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "cloudtrail"}, {"checkname": "cloudtrailManagementEvents", "title": "CloudTrail Management Events", "severity": "Medium", "description": "Ensures that AWS CloudTrail trails are configured to log management events.", "more_info": "AWS CloudTrail trails should be configured to log management events to record management operations that are performed on resources in your AWS account.", "service": "cloudtrail"}, {"checkname": "cloudtrailNotificationsEnabled", "title": "CloudTrail Notifications Enabled", "severity": "MEDIUM", "description": "Ensure that Amazon CloudTrail trails are using active Simple Notification Service (SNS) topics to deliver notifications.", "more_info": "CloudTrail trails should reference active SNS topics to notify for log files delivery to S3 buckets. Otherwise, you will lose the ability to take immediate actions based on log information.", "service": "cloudtrail"}, {"checkname": "cloudtrailObjectLock", "title": "Object Lock Enabled", "severity": "Medium", "description": "Ensures that AWS CloudTrail S3 buckets use Object Lock for data protection and regulatory compliance.", "more_info": "CloudTrail buckets should be configured to have object lock enabled. You can use it to prevent an object from being deleted or overwritten for a fixed amount of time or indefinitely.", "service": "cloudtrail"}, {"checkname": "cloudtrailS3Bucket", "title": "CloudTrail S3 Bucket", "severity": "Medium", "description": "Ensure that AWS CloudTrail trail uses the designated Amazon S3 bucket.", "more_info": "Ensure that your Amazon CloudTrail trail is configured to use the appropriated S3 bucket in order to meet regulatory compliance requirements within your organization.", "service": "cloudtrail"}, {"checkname": "cloudtrailToCloudwatch", "title": "CloudTrail To CloudWatch", "severity": "Medium", "description": "Ensures CloudTrail logs are being properly delivered to CloudWatch", "more_info": "Sending CloudTrail logs to CloudWatch enables easy integration with AWS CloudWatch alerts, as well as an additional backup log storage location.", "service": "cloudtrail"}, {"checkname": "globalLoggingDuplicated", "title": "CloudTrail Global Services Logging Duplicated", "severity": "Medium", "description": "Ensures that AWS CloudTrail trails are not duplicating global services events in log files.", "more_info": "Only one trail should have Include Global Services feature enabled to avoid duplication of global services events in log files.", "service": "cloudtrail"}, {"checkname": "vpcFlowLogsMetricAlarm", "title": "VPC Flow Logs Metric Alarm", "severity": "Low", "description": "Ensure that an AWS CloudWatch alarm exists and configured for metric filter attached with VPC flow logs CloudWatch group.", "more_info": "", "service": "cloudwatch"}, {"checkname": "logGroupsEncrypted", "title": "CloudWatch Log Groups Encrypted", "severity": "High", "description": "Ensure that the CloudWatch Log groups are encrypted using desired encryption level.", "more_info": "", "service": "cloudwatchlogs"}, {"checkname": "logRetentionPeriod", "title": "CloudWatch Log Retention Period", "severity": "Medium", "description": "Ensures that the CloudWatch Log retention period is set above a specified length of time.", "more_info": "Retention settings can be used to specify how long log events are kept in CloudWatch Logs. Expired log events get deleted automatically.", "service": "cloudwatchlogs"}, {"checkname": "monitoringMetrics", "title": "CloudWatch Monitoring Metrics", "severity": "Medium", "description": "Ensures metric filters are setup for CloudWatch logs to detect security risks from CloudTrail.", "more_info": "Sending CloudTrail logs to CloudWatch is only useful if metrics are setup to detect risky activity from those logs. There are numerous metrics that should be used. For the exact filter patterns, please see this plugin on GitHub: https://github.com/cloudsploit/scans/blob/master/plugins/aws/cloudwatchlogs/monitoringMetrics.js", "service": "cloudwatchlogs"}, {"checkname": "codeartifactDomainEncrypted", "title": "CodeArtifact Domain Encrypted", "severity": "High", "description": "Ensures that AWS CodeArtifact domains have encryption enabled with desired encryption level.", "more_info": "", "service": "codeartifact"}, {"checkname": "codebuildValidSourceProviders", "title": "CodeBuild Valid Source Providers", "severity": "Medium", "description": "Ensure that CodeBuild projects are using only valid source providers.", "more_info": "", "service": "codebuild"}, {"checkname": "projectArtifactsEncrypted", "title": "Project Artifacts Encrypted", "severity": "High", "description": "Ensure that your AWS CodeBuild project artifacts are encrypted with desired encryption level.", "more_info": "", "service": "codebuild"}, {"checkname": "pipelineArtifactsEncrypted", "title": "Pipeline Artifacts Encrypted", "severity": "High", "description": "Ensure that AWS CodePipeline is using desired encryption level to encrypt pipeline artifacts being stored in S3.", "more_info": "", "service": "codepipeline"}, {"checkname": "codestarHasTags", "title": "CodeStar Has Tags", "severity": "Low", "description": "Ensures that CodeStar projects has tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "codestar"}, {"checkname": "codestarValidRepoProviders", "title": "CodeStar Valid Repository Providers", "severity": "Medium", "description": "Ensure that CodeStar projects are not using undesired repository providers.", "more_info": "", "service": "codestar"}, {"checkname": "cognitoHasWafEnabled", "title": "Cognito User Pool WAF Enabled", "severity": "Medium", "description": "Ensure that Cognito User Pool has WAF enabled.", "more_info": "Enabling WAF allows control over unwanted requests to your hosted UI and Amazon Cognito API service endpoints, allowing or denying traffic based off rules in the Web ACL.", "service": "cognito"}, {"checkname": "cognitoMFAEnabled", "title": "Cognito User Pool MFA enabled", "severity": "Medium", "description": "Ensure that Cognito user pool has MFA enabled.", "more_info": "Enabling Multi-factor authentication (MFA) increases security for your app. You can choose SMS text messages or time-based one-time passwords (TOTP) as second factors to sign in your users.", "service": "cognito"}, {"checkname": "flywheelInVpc", "title": "Amazon Comprehend Flywheel In VPC", "severity": "Low", "description": "Ensure that an Amazon Comprehend Flywheel is configured with a VPC.", "more_info": "Configuring Amazon Comprehend flywheel within a VPC, establishes a secure environment that prevents unauthorized access to your data stored in job containers, minimizing the risk of internet exposure, data breaches and ensuring compliance with security standards.", "service": "comprehend"}, {"checkname": "outputResultEncryption", "title": "Amazon Comprehend Output Result Encryption", "severity": "High", "description": "Ensures the Comprehend service is using encryption for all result output.", "more_info": "Comprehend supports using KMS keys to result output, which should be enabled.", "service": "comprehend"}, {"checkname": "volumeEncryption", "title": "Amazon Comprehend Volume Encryption", "severity": "High", "description": "Ensures the Comprehend service is using encryption for all volumes storing data at rest.", "more_info": "Comprehend supports using KMS keys to encrypt data at rest, which should be enabled.", "service": "comprehend"}, {"checkname": "asgOptimized", "title": "Auto Scaling Group Optimized", "severity": "Medium", "description": "Ensure that Compute Optimizer does not have active recommendation summaries for unoptimized Auto Scaling groups.", "more_info": "An Auto Scaling group is considered optimized when Compute Optimizer determines that the group is correctly provisioned to run your workload, based on the chosen instance type. For optimized Auto Scaling groups, Compute Optimizer might sometimes recommend a new generation instance type.", "service": "computeoptimizer"}, {"checkname": "ebsVolumesOptimized", "title": "EBS Volumes Optimized", "severity": "Medium", "description": "Ensure that Compute Optimizer does not have active recommendation summaries for unoptimized EBS Volumes.", "more_info": "An EBS volume is considered optimized when Compute Optimizer determines that the volume is correctly provisioned to run your workload, based on the chosen volume type, volume size, and IOPS specification. For optimized resources, Compute Optimizer might sometimes recommend a new generation volume type.", "service": "computeoptimizer"}, {"checkname": "ec2InstancesOptimized", "title": "EC2 Instances Optimized", "severity": "Medium", "description": "Ensure that Compute Optimizer does not have active recommendation summaries for over-provisioned or under-provisioned EC2 instances.", "more_info": "An EC2 instance is considered optimized when all specifications of an instance, such as CPU, memory, and network, meet the performance requirements of your workload, and the instance is not over-provisioned. For optimized instances, Compute Optimizer might sometimes recommend a new generation instance type.", "service": "computeoptimizer"}, {"checkname": "lambdaFunctionsOptimized", "title": "Lambda Function Optimized", "severity": "Medium", "description": "Ensure that Compute Optimizer does not have active recommendation summaries for unoptimized Lambda Functions.", "more_info": "AWS Compute Optimizer generates memory size recommendations for AWS Lambda functions. A Lambda function is considered optimized when Compute Optimizer determines that its configured memory or CPU power (which is proportional to the configured memory) is correctly provisioned to run your workload.", "service": "computeoptimizer"}, {"checkname": "optimizerRecommendationsEnabled", "title": "Compute Optimizer Recommendations Enabled", "severity": "Low", "description": "Ensure that Compute Optimizer is enabled for your AWS account.", "more_info": "AWS Compute Optimizer is a service that analyzes the configuration and utilization metrics of your AWS resources. It reports whether your resources are optimal, and generates optimization recommendations to reduce the cost and improve the performance of your workloads.", "service": "computeoptimizer"}, {"checkname": "configComplaintRules", "title": "AWS Config Complaint Rules", "severity": "Medium", "description": "Ensures that all the evaluation results returned from the Amazon Config rules created within your AWS account are compliant.", "more_info": "AWS Config provides AWS managed rules, which are predefined customizable rules that AWS Config uses to evaluate whether your AWS resources comply with common best practices.", "service": "configservice"}, {"checkname": "configDeliveryFailing", "title": "Config Delivery Failing", "severity": "Medium", "description": "Ensure that the AWS Config log files are delivered to the S3 bucket in order to store logging data for auditing purposes without any failures.", "more_info": "Amazon Config keep record of the changes within the configuration of your AWS resources and it regularly stores this data to log files that are send to an S3 bucket specified by you.", "service": "configservice"}, {"checkname": "configServiceEnabled", "title": "Config Service Enabled", "severity": "Medium", "description": "Ensures the AWS Config Service is enabled to detect changes to account resources", "more_info": "The AWS Config Service tracks changes to a number of resources in an AWS account and is invaluable in determining how account changes affect other resources and in recovery in the event of an account intrusion or accidental configuration change.", "service": "configservice"}, {"checkname": "configServiceMissingBucket", "title": "Config Service Missing Bucket", "severity": "High", "description": "Ensure that Amazon Config service is pointing an S3 bucket that is active in your account in order to save configuration information", "more_info": "", "service": "configservice"}, {"checkname": "servicesInUse", "title": "AWS Services In Use", "severity": "Medium", "description": "Ensures that only permitted services are being used in you AWS cloud account.", "more_info": "Use only permitted AWS services in your cloud account in order to meet security and compliance requirements within your organization.", "service": "configservice"}, {"checkname": "customerProfilesDomainEncrypted", "title": "Connect Customer Profiles Domain Encrypted", "severity": "High", "description": "Ensure that AWS Connect Customer Profiles domains are using desired encryption level.", "more_info": "Customer profiles domain is a container for all data, such as customer profiles, object types, profile keys, and encryption keys. To encrypt this data, use a KMS key with desired encrypted level to meet regulatory compliance requirements within your organization.", "service": "connect"}, {"checkname": "instanceAttachmentsEncrypted", "title": "Connect Instance Attachments Encrypted", "severity": "High", "description": "Ensure that Amazon Connect instances have encryption enabled for attachments being saved on S3.", "more_info": "", "service": "connect"}, {"checkname": "instanceCallRecordingEncrypted", "title": "Connect Instance Call Recording Encrypted", "severity": "High", "description": "Ensure that Amazon Connect instances have encryption enabled for call recordings being saved on S3.", "more_info": "", "service": "connect"}, {"checkname": "instanceMediaStreamsEncrypted", "title": "Connect Instance Media Streams Encrypted", "severity": "High", "description": "Ensure that Amazon Connect instances have encryption enabled for media streams being saved on Kinesis Video Stream.", "more_info": "", "service": "connect"}, {"checkname": "instanceReportsEncrypted", "title": "Connect Instance Exported Reports Encrypted", "severity": "High", "description": "Ensure that Amazon Connect instances have encryption enabled for exported reports being saved on S3.", "more_info": "", "service": "connect"}, {"checkname": "instanceTranscriptsEncrypted", "title": "Connect Instance Chat Transcripts Encrypted", "severity": "High", "description": "Ensure that Amazon Connect instances have encryption enabled for chat transcripts being saved on S3.", "more_info": "", "service": "connect"}, {"checkname": "voiceIdDomainEncrypted", "title": "Connect Voice ID Domain Encrypted", "severity": "High", "description": "Ensure that Voice domains created under Amazon Connect instances are using desired KMS encryption level.", "more_info": "All user data stored in Amazon Connect Voice ID is encrypted at rest using encryption keys stored in AWS Key Management Service. Additionally, you can provide customer managed KMS keys in order to gain more control over encryption/decryption processes.", "service": "connect"}, {"checkname": "wisdomDomainEncrypted", "title": "Connect Wisdom Domain Encrypted", "severity": "High", "description": "Ensure that Wisdom domains created under Amazon Connect instances are using desired KMS encryption level.", "more_info": "All user data stored in Amazon Connect Wisdom is encrypted at rest using encryption keys stored in AWS Key Management Service. Additionally, you can provide customer managed KMS keys in order to gain more control over encryption/decryption processes.", "service": "connect"}, {"checkname": "devOpsGuruNotificationEnabled", "title": "DevOps Guru Notifications Enabled", "severity": "Low", "description": "Ensures SNS topic is set up for Amazon DevOps Guru.", "more_info": "Amazon DevOps Guru uses an SNS topic to notify you about important DevOps Guru events.", "service": "devopsguru"}, {"checkname": "autoMinorVersionUpgrade", "title": "DMS Auto Minor Version Upgrade", "severity": "Medium", "description": "Ensure that your Amazon Database Migration Service (DMS) replication instances have the Auto Minor Version Upgrade feature enabled", "more_info": "AWS Database Migration Service (AWS DMS) helps you migrate databases to AWS quickly and securely. The DMS service releases engine version upgrades regularly to introduce new software features, bug fixes, security patches and performance improvements.", "service": "dms"}, {"checkname": "dmsEncryptionEnabled", "title": "DMS Encryption Enabled", "severity": "High", "description": "Ensures DMS encryption is enabled using a CMK", "more_info": "Data sent through the data migration service is encrypted using KMS. Encryption is enabled by default, but it is recommended to use customer managed keys.", "service": "dms"}, {"checkname": "dmsMultiAZFeatureEnabled", "title": "DMS Multi-AZ Feature Enabled", "severity": "Medium", "description": "Ensure that your Amazon Database Migration Service (DMS) replication instances are using Multi-AZ deployment configurations.", "more_info": "AWS Database Migration Service (AWS DMS) helps you migrate databases to AWS quickly and securely. In a Multi-AZ deployment, AWS DMS automatically provisions and maintains a synchronous standby replica of the replication instance in a different Availability Zone.", "service": "dms"}, {"checkname": "dmsPubliclyAccessibleInstances", "title": "DMS Publicly Accessible Instances", "severity": "High", "description": "Ensure that Amazon Database Migration Service (DMS) instances are not publicly accessible.", "more_info": "An AWS DMS replication instance can have one public IP address and one private IP address. If you uncheck (disable) the box for Publicly accessible, then the replication instance has only a private IP address. that prevents from exposure of data to other users", "service": "dms"}, {"checkname": "docdbClusterBackupRetention", "title": "DocumentDB Cluster Backup Retention", "severity": "Medium", "description": "Ensure that your Amazon DocumentDB clusters have set a minimum backup retention period.", "more_info": "DocumentDB cluster provides feature to retain incremental backups between 1 and 35 allowing you to quickly restore to any point within the backup retention period. Ensure that you have sufficient backup retention period configured in order to restore your data in the event of failure.", "service": "documentDB"}, {"checkname": "docdbClusterEncrypted", "title": "DocumentDB Cluster Encrypted", "severity": "High", "description": "Ensure that data at-rest in encrypted in AWS DocumentDB clusters using desired encryption level.", "more_info": "", "service": "documentDB"}, {"checkname": "daxClusterEncryption", "title": "DynamoDB Accelerator Cluster Encryption", "severity": "High", "description": "Ensures DynamoDB Cluster Accelerator DAX clusters have encryption enabled.", "more_info": "DynamoDB Clusters Accelerator DAX clusters should have encryption at rest enabled to secure data from unauthorized access.", "service": "dynamodb"}, {"checkname": "dynamoContinuousBackups", "title": "DynamoDB Continuous Backups", "severity": "Medium", "description": "Ensures that Amazon DynamoDB tables have continuous backups enabled.", "more_info": "DynamoDB tables should have Continuous Backups and Point-In-Time Recovery (PITR) features enabled to protect DynamoDB data against accidental data writes.", "service": "dynamodb"}, {"checkname": "dynamoDeletionProtection", "title": "DynamoDB Deletion Protection Enabled", "severity": "Medium", "description": "Ensures that DynamoDB tables have deletion protection feature enabled.", "more_info": "Enabling deletion protection feature ensures the prevention of accidental deletion of DynamoDB tables during regular maintenance operations, thereby safeguarding your data.", "service": "dynamodb"}, {"checkname": "dynamoKmsEncryption", "title": "DynamoDB KMS Encryption", "severity": "High", "description": "Ensures DynamoDB tables are encrypted using a customer-owned KMS key.", "more_info": "DynamoDB tables can be encrypted using AWS-owned or customer-owned KMS keys. Customer keys should be used to ensure control over the encryption seed data.", "service": "dynamodb"}, {"checkname": "dynamoTableBackupExists", "title": "DynamoDB Table Backup Exists", "severity": "Medium", "description": "Ensures that Amazon DynamoDB tables are using on-demand backups.", "more_info": "With AWS Backup, you can configure backup policies and monitor activity for your AWS resources and on-premises workloads in one place. Using DynamoDB with AWS Backup, you can copy your on-demand backups across AWS accounts and regions, add cost allocation tags to on-demand backups, and transition on-demand backups to cold storage for lower costs.", "service": "dynamodb"}, {"checkname": "dynamoTableHasTags", "title": "DynamoDB Table Has Tags", "severity": "Low", "description": "Ensure that DynamoDB tables have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "dynamodb"}, {"checkname": "dynamoUnusedTable", "title": "DynamoDB Empty Table", "severity": "Low", "description": "Ensures that Amazon DynamoDB empty tables are removed to optimise costs.", "more_info": "A DynamoDB table is considered unused if its item count is zero. As a best practice, delete unused tables for operational efficiency and better resource management. This will also prevent resource wastage and unnecessary costs. This plugin might produce false positives or false negatives as AWS updates table count every 6 hours.", "service": "dynamodb"}, {"checkname": "allowedCustomPorts", "title": "Allowed Custom Ports", "severity": "High", "description": "Ensures that security groups does not allow public access to any port.", "more_info": "Security groups should be used to restrict access to ports from known networks.", "service": "ec2"}, {"checkname": "amiHasTags", "title": "AMI Has Tags", "severity": "Low", "description": "Ensure that AMIs have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ec2"}, {"checkname": "appTierInstanceIamRole", "title": "App-Tier EC2 Instance IAM Role", "severity": "Medium", "description": "Ensure IAM roles attached with App-Tier EC2 instances have IAM policies attached.", "more_info": "EC2 instances should have IAM roles configured with necessary permission to access other AWS services", "service": "ec2"}, {"checkname": "classicInstances", "title": "Detect EC2 Classic Instances", "severity": "High", "description": "Ensures AWS VPC is being used for instances instead of EC2 Classic", "more_info": "VPCs are the latest and more secure method of launching AWS resources. EC2 Classic should not be used.", "service": "ec2"}, {"checkname": "crossVpcPublicPrivate", "title": "Cross VPC Public Private Communication", "severity": "High", "description": "Ensures communication between public and private VPC tiers is not enabled", "more_info": "Communication between the public tier of one VPC and the private tier of other VPCs should never be allowed. Instead, VPC peerings with proper NACLs and gateways should be used", "service": "ec2"}, {"checkname": "defaultSecurityGroup", "title": "Default Security Group", "severity": "Medium", "description": "Ensure the default security groups block all traffic by default", "more_info": "The default security group is often used for resources launched without a defined security group. For this reason, the default rules should be to block all traffic to prevent an accidental exposure.", "service": "ec2"}, {"checkname": "defaultSecurityGroupInUse", "title": "Default Security Group In Use", "severity": "Medium", "description": "Ensure that AWS EC2 Instances are not associated with default security group.", "more_info": "The default security group allows all traffic inbound and outbound, which can make your resources vulnerable to attacks. Ensure that the Amazon EC2 instances are not associated with the default security groups.", "service": "ec2"}, {"checkname": "defaultVpcExists", "title": "Default VPC Exists", "severity": "Low", "description": "Determines whether the default VPC exists.", "more_info": "The default VPC should not be used in order to avoid launching multiple services in the same network which may not require connectivity. Each application, or network tier, should use its own VPC.", "service": "ec2"}, {"checkname": "defaultVpcInUse", "title": "Default VPC In Use", "severity": "Medium", "description": "Determines whether the default VPC is being used for launching EC2 instances.", "more_info": "The default VPC should not be used in order to avoid launching multiple services in the same network which may not require connectivity. Each application, or network tier, should use its own VPC.", "service": "ec2"}, {"checkname": "ebsBackupEnabled", "title": "EBS Backup Enabled", "severity": "Medium", "description": "Checks whether EBS Backup is enabled", "more_info": "EBS volumes should have backups in the form of snapshots.", "service": "ec2"}, {"checkname": "ebsDefaultEncryptionEnabled", "title": "EBS Encryption Enabled By Default", "severity": "High", "description": "Ensure the setting for encryption by default is enabled", "more_info": "AWS account should be configured to enable encryption for new EBS volumes and snapshots for all regions.", "service": "ec2"}, {"checkname": "ebsEncryptedSnapshots", "title": "EBS Encrypted Snapshots", "severity": "High", "description": "Ensures EBS snapshots are encrypted at rest", "more_info": "EBS snapshots should have at-rest encryption enabled through AWS using KMS. If the volume was not encrypted and a snapshot was taken the snapshot will be unencrypted.", "service": "ec2"}, {"checkname": "ebsEncryptionEnabled", "title": "EBS Encryption Enabled", "severity": "High", "description": "Ensures EBS volumes are encrypted at rest", "more_info": "EBS volumes should have at-rest encryption enabled through AWS using KMS. If the volume is used for a root volume, the instance must be launched from an AMI that has been encrypted as well.", "service": "ec2"}, {"checkname": "ebsOldSnapshots", "title": "EBS Volumes Too Old Snapshots", "severity": "Low", "description": "Ensure that EBS volume snapshots are deleted after defined time period.", "more_info": "EBS volume snapshots older than indicated should be deleted after defined time period for cost optimization.", "service": "ec2"}, {"checkname": "ebsRecentSnapshots", "title": "EBS Volumes Recent Snapshots", "severity": "Medium", "description": "Ensures that EBS volume has had a snapshot within the last 7 days", "more_info": "EBS volumes without recent snapshots may be at risk of data loss or recovery issues.", "service": "ec2"}, {"checkname": "ebsSnapshotHasTags", "title": "EBS Snapshot Has Tags", "severity": "Low", "description": "Ensure that EBS snapshots have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ec2"}, {"checkname": "ebsSnapshotLifecycle", "title": "Automate EBS Snapshot Lifecycle", "severity": "Medium", "description": "Ensure DLM is used to automate EBS volume snapshots management.", "more_info": "Amazon Data Lifecycle Manager (DLM) service enables you to manage the lifecycle of EBS volume snapshots.\\\n            Using DLM helps in enforcing regular backup schedule, retaining backups, deleting outdated EBS snapshots", "service": "ec2"}, {"checkname": "ebsSnapshotPrivate", "title": "EBS Volume Snapshot Public", "severity": "High", "description": "Ensures EBS volume snapshots are private", "more_info": "EBS volumes often contain sensitive data from running EC2 instances and should be set to private so they cannot be accidentally shared with other accounts.", "service": "ec2"}, {"checkname": "ebsSnapshotPublic", "title": "Amazon EBS Public Snapshots", "severity": "High", "description": "Ensure that Amazon EBS volume snapshots are not shared to all AWS accounts.", "more_info": "AWS Elastic Block Store (EBS) volume snapshots should not be not publicly shared with other AWS account to avoid data exposure.", "service": "ec2"}, {"checkname": "ebsUnusedVolumes", "title": "Unused EBS Volumes", "severity": "Medium", "description": "Ensures EBS volumes are in use and attached to EC2 instances", "more_info": "EBS volumes should be deleted if the parent instance has been deleted to prevent accidental exposure of data.", "service": "ec2"}, {"checkname": "ebsVolumeHasTags", "title": "EBS Volume has tags", "severity": "Low", "description": "Ensure that EBS Volumes have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ec2"}, {"checkname": "ec2HasTags", "title": "EC2 has Tags", "severity": "Low", "description": "Ensure that AWS EC2 Instances have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ec2"}, {"checkname": "ec2MetadataOptions", "title": "Insecure EC2 Metadata Options", "severity": "Medium", "description": "Ensures EC2 instance metadata is updated to require HttpTokens or disable HttpEndpoint", "more_info": "The new EC2 metadata service prevents SSRF attack escalations from accessing the sensitive instance metadata endpoints.", "service": "ec2"}, {"checkname": "elasticIpLimit", "title": "Elastic IP Limit", "severity": "Medium", "description": "Determine if the number of allocated EIPs is close to the AWS per-account limit", "more_info": "AWS limits accounts to certain numbers of resources. Exceeding those limits could prevent resources from launching.", "service": "ec2"}, {"checkname": "enableDetailedMonitoring", "title": "Instance Detailed Monitoring", "severity": "Low", "description": "Ensure that EC2 instances have detailed monitoring feature enabled.", "more_info": "By default, your instance is enabled for basic monitoring. After you enable detailed monitoring, EC2 console displays monitoring graphs with a 1-minute period.", "service": "ec2"}, {"checkname": "encryptedAmi", "title": "Encrypted AMI", "severity": "High", "description": "Ensures EBS-backed AMIs are configured to use encryption", "more_info": "AMIs with unencrypted data volumes can be used to launch unencrypted instances that place data at risk.", "service": "ec2"}, {"checkname": "excessiveSecurityGroups", "title": "Excessive Security Groups", "severity": "Medium", "description": "Determine if there are an excessive number of security groups in the account", "more_info": "Keeping the number of security groups to a minimum helps reduce the attack surface of an account. Rather than creating new groups with the same rules for each project, common rules should be grouped under the same security groups. For example, instead of adding port 22 from a known IP to every group, create a single \"SSH\" security group which can be used on multiple instances.", "service": "ec2"}, {"checkname": "flowLogsEnabled", "title": "VPC Flow Logs Enabled", "severity": "Low", "description": "Ensures VPC flow logs are enabled for traffic logging", "more_info": "VPC flow logs record all traffic flowing in to and out of a VPC. These logs are critical for auditing and review after security incidents.", "service": "ec2"}, {"checkname": "instanceIamRole", "title": "Instance IAM Role", "severity": "High", "description": "Ensures EC2 instances are using an IAM role instead of hard-coded AWS credentials", "more_info": "IAM roles should be assigned to all instances to enable them to access AWS resources. Using an IAM role is more secure than hard-coding AWS access keys into application code.", "service": "ec2"}, {"checkname": "instanceKeyBasedLogin", "title": "EC2 Instance Key Based Login", "severity": "Medium", "description": "Ensures EC2 instances have associated keys for password-less SSH login", "more_info": "AWS allows EC2 instances to be launched with a specified PEM key for SSH login which should be used instead of user and password login.", "service": "ec2"}, {"checkname": "instanceLimit", "title": "Instance Limit", "severity": "Medium", "description": "Determine if the number of EC2 instances is close to the AWS per-account limit", "more_info": "AWS limits accounts to certain numbers of resources. Exceeding those limits could prevent resources from launching.", "service": "ec2"}, {"checkname": "instanceMaxCount", "title": "EC2 Max Instances", "severity": "High", "description": "Ensures the total number of EC2 instances does not exceed a set threshold.", "more_info": "The number of running EC2 instances should be carefully audited, especially in unused regions, to ensure only approved applications are consuming compute resources. Many compromised AWS accounts see large numbers of EC2 instances launched.", "service": "ec2"}, {"checkname": "instanceVcpusLimit", "title": "Instance vCPU On-Demand Based Limits", "severity": "Medium", "description": "Determine if the number of EC2 On-Demand instances is close to the regional vCPU based limit.", "more_info": "AWS limits accounts to certain numbers of resources per region. Exceeding those limits could prevent resources from launching.", "service": "ec2"}, {"checkname": "internetGatewayInVpc", "title": "Internet Gateways In VPC", "severity": "Medium", "description": "Ensure Internet Gateways are associated with at least one available VPC.", "more_info": "", "service": "ec2"}, {"checkname": "launchWizardSecurityGroups", "title": "EC2 LaunchWizard Security Groups", "severity": "Low", "description": "Ensures security groups created by the EC2 launch wizard are not used", "more_info": "The EC2 launch wizard frequently creates insecure security groups that are exposed publicly. These groups should not be used and custom security groups should be created instead.", "service": "ec2"}, {"checkname": "managedNatGateway", "title": "Managed NAT Gateway In Use", "severity": "Medium", "description": "Ensure AWS VPC Managed NAT (Network Address Translation) Gateway service is enabled for high availability (HA).", "more_info": "VPCs should use highly available Managed NAT Gateways in order to enable EC2 instances to connect to the internet or with other AWS components.", "service": "ec2"}, {"checkname": "multipleSubnets", "title": "VPC Multiple Subnets", "severity": "Medium", "description": "Ensures that VPCs have multiple subnets to provide a layered architecture", "more_info": "VPCs should be designed to have separate public and private subnets, ideally across availability zones, enabling a DMZ-style architecture.", "service": "ec2"}, {"checkname": "natMultiAz", "title": "NAT Multiple AZ", "severity": "Medium", "description": "Ensures managed NAT instances exist in at least 2 AZs for availability purposes", "more_info": "Creating NAT instances in a single AZ creates a single point of failure for all systems in the VPC. All managed NAT instances should be created in multiple AZs to ensure proper failover.", "service": "ec2"}, {"checkname": "networkAclHasTags", "title": "Network ACL has Tags", "severity": "Low", "description": "Ensure that Amazon Network ACLs have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ec2"}, {"checkname": "networkAclInboundTraffic", "title": "Unrestricted Network ACL Inbound Traffic", "severity": "High", "description": "Ensures that no Amazon Network ACL allows inbound/ingress traffic to remote administration ports.", "more_info": "Amazon Network ACL should not allow inbound/ingress traffic to remote administration ports to avoid unauthorized access at the subnet level.", "service": "ec2"}, {"checkname": "networkAclOutboundTraffic", "title": "Unrestricted Network ACL Outbound Traffic", "severity": "Medium", "description": "Ensures that no Amazon Network ACL allows outbound/egress traffic to all ports.", "more_info": "Amazon Network ACL should not allow outbound/egress traffic to all ports to avoid unauthorized access at the subnet level.", "service": "ec2"}, {"checkname": "openAllPortsProtocols", "title": "Open All Ports Protocols", "severity": "High", "description": "Determine if security group has all ports or protocols open to the public", "more_info": "Security groups should be created on a per-service basis and avoid allowing all ports or protocols.", "service": "ec2"}, {"checkname": "openAllPortsProtocolsEgress", "title": "Open All Ports Protocols Egress", "severity": "High", "description": "Determine if security group has all outbound ports or protocols open to the public", "more_info": "Security groups should be created on a per-service basis and avoid allowing all ports or protocols in order to implement the Principle of Least Privilege (POLP) and reduce the attack surface.", "service": "ec2"}, {"checkname": "openCIFS", "title": "Open CIFS", "severity": "High", "description": "Determine if UDP port 445 for CIFS is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as CIFS should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openCassandraClient", "title": "Open Cassandra Client", "severity": "High", "description": "Determine if TCP port 9042 for Cassandra Client is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Cassandra Client should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openCassandraInternode", "title": "Open Cassandra Internode", "severity": "High", "description": "Determine if TCP port 7000 for Cassandra Internode is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Cassandra Internode should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openCassandraMonitoring", "title": "Open Cassandra Monitoring", "severity": "High", "description": "Determine if TCP port 7199 for Cassandra Monitoring is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Cassandra Client should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openCassandraThrift", "title": "Open Cassandra Thrift", "severity": "High", "description": "Determine if TCP port 9160 for Cassandra Thrift is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Cassandra Client should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openCustomPorts", "title": "Open Custom Ports", "severity": "High", "description": "Ensure that defined custom ports are not open to public.", "more_info": "Security groups should restrict access to ports from known networks.", "service": "ec2"}, {"checkname": "openDNS", "title": "Open DNS", "severity": "High", "description": "Determine if TCP or UDP port 53 for DNS is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as DNS should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openDocker", "title": "Open Docker", "severity": "Critical", "description": "Determine if Docker port 2375 or 2376 is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Docker should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openElasticsearch", "title": "Open Elasticsearch", "severity": "High", "description": "Determine if TCP port 9200 or 9300 for Elasticsearch is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Elasticsearch should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openFTP", "title": "Open FTP", "severity": "High", "description": "Determine if TCP port 20 or 21 for FTP is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as FTP should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openHTTP", "title": "Open HTTP", "severity": "High", "description": "Determine if TCP port 80 for HTTP is open to the public", "more_info": "While some ports are required to be open to the public to function properly, more sensitive services such as HTTP should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openHTTPS", "title": "Open HTTPS", "severity": "High", "description": "Determine if TCP port 443 for HTTPS is open to the public", "more_info": "While some ports are required to be open to the public to function properly, more sensitive services such as HTTPS should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openHadoopNameNode", "title": "Open Hadoop HDFS NameNode Metadata Service", "severity": "High", "description": "Determine if TCP port 8020 for HDFS NameNode metadata service is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Hadoop/HDFS should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openHadoopNameNodeWebUI", "title": "Open Hadoop HDFS NameNode WebUI", "severity": "High", "description": "Determine if TCP port 50070 and 50470 for Hadoop/HDFS NameNode WebUI service is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Hadoop/HDFS should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openInternalWeb", "title": "Open Internal Web", "severity": "High", "description": "Determine if TCP port 8080 for internal web is open to the public", "more_info": "Internal web port 8080 is used for web applications and proxy services. Allowing Inbound traffic from any IP address to TCP port 8080 is vulnerable to exploits like backdoor trojan attacks. It is a best practice to block port 8080 from the public internet.", "service": "ec2"}, {"checkname": "openKibana", "title": "Open Kibana", "severity": "High", "description": "Determine if TCP port 5601 for Kibana is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Kibana should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openLDAP", "title": "Open LDAP", "severity": "High", "description": "Determine if TCP or UDP port 389 for LDAP is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as LDAP should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openLDAPS", "title": "Open LDAPS", "severity": "High", "description": "Determine if TCP port 636 for LDAP SSL is open to the public", "more_info": "LDAP SSL port 636 is used for Secure LDAP authentication. Allowing Inbound traffic from any IP address to TCP port 636 is vulnerable to DoS attacks. It is a best practice to block port 636 from the public internet.", "service": "ec2"}, {"checkname": "openMemcached", "title": "Open Memcached", "severity": "High", "description": "Determine if TCP or UDP port 11211 for Memcached is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Memcached should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openMongoDB", "title": "Open MongoDB", "severity": "High", "description": "Determine if TCP port 27017 or 27018 or 27019 for MongoDB is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as MongoDB should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openMySQL", "title": "Open MySQL", "severity": "High", "description": "Determine if TCP port 4333 or 3306 for MySQL is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as MySQL should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openNetBIOS", "title": "Open NetBIOS", "severity": "High", "description": "Determine if UDP port 137 or 138 or 139 for NetBIOS is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as NetBIOS should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openOracle", "title": "Open Oracle", "severity": "High", "description": "Determine if TCP ports 1521 , 2483 for Oracle is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open \\\n        to the public to function properly, more sensitive services such as Oracle \\\n        should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openOracleAutoDataWarehouse", "title": "Open Oracle Auto Data Warehouse", "severity": "High", "description": "Determine if TCP port 1522 for Oracle Auto Data Warehouse is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open \\\n        to the public to function properly, more sensitive services such as Oracle Auto Data Warehouse \\\n        should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openPostgreSQL", "title": "Open PostgreSQL", "severity": "High", "description": "Determine if TCP port 5432 for PostgreSQL is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as PostgreSQL should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openRDP", "title": "Open RDP", "severity": "High", "description": "Determine if TCP port 3389 for RDP is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as RDP should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openRPC", "title": "Open RPC", "severity": "High", "description": "Determine if TCP port 135 for RPC is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as RPC should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openRedis", "title": "Open Redis", "severity": "High", "description": "Determine if TCP port 6379 for Redis is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Redis should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openSMBoTCP", "title": "Open SMBoTCP", "severity": "High", "description": "Determine if TCP port 445 for Windows SMB over TCP is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as SMB should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openSMTP", "title": "Open SMTP", "severity": "High", "description": "Determine if TCP port 25 for SMTP is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as SMTP should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openSNMP", "title": "Open SNMP", "severity": "High", "description": "Determine if UDP port 161 for SNMP is open to the public", "more_info": "SNMP UDP 161 used by various devices and applications for logging events, monitoring and management. Allowing Inbound traffic from any external IP address on port 161 is vulnerable to DoS attack. It is a best practice to block port 161 completely unless explicitly required.", "service": "ec2"}, {"checkname": "openSQLServer", "title": "Open SQL Server", "severity": "High", "description": "Determine if TCP port 1433 or UDP port 1434 for SQL Server is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as SQL server should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openSSH", "title": "Open SSH", "severity": "High", "description": "Determine if TCP port 22 for SSH is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as SSH should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openSalt", "title": "Open Salt", "severity": "High", "description": "Determine if TCP ports 4505 or 4506 for the Salt master are open to the public", "more_info": "Active Salt vulnerabilities, CVE-2020-11651 and CVE-2020-11652 are exploiting Salt instances exposed to the internet. These ports should be closed immediately.", "service": "ec2"}, {"checkname": "openTelnet", "title": "Open Telnet", "severity": "High", "description": "Determine if TCP port 23 for Telnet is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as Telnet should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openVNCClient", "title": "Open VNC Client", "severity": "Critical", "description": "Determine if TCP port 5500 for VNC Client is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as VNC Client should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "openVNCServer", "title": "Open VNC Server", "severity": "High", "description": "Determine if TCP port 5900 for VNC Server is open to the public", "more_info": "While some ports such as HTTP and HTTPS are required to be open to the public to function properly, more sensitive services such as VNC Server should be restricted to known IP addresses.", "service": "ec2"}, {"checkname": "outdatedAmiInUse", "title": "Outdated Amazon Machine Images", "severity": "Low", "description": "Ensures that deprecated Amazon Machine Images are not in use.", "more_info": "Deprecated Amazon Machine Images should not be used to make an instance.", "service": "ec2"}, {"checkname": "overlappingSecurityGroups", "title": "Overlapping Security Groups", "severity": "Medium", "description": "Determine if EC2 instances have security groups that share the same rules", "more_info": "", "service": "ec2"}, {"checkname": "overutilizedEC2Instance", "title": "EC2 CPU Alarm Threshold Exceeded", "severity": "High", "description": "Ensure EC2 instances do not exceed the alarm threshold for CPU utilization.", "more_info": "Excessive CPU utilization can indicate performance issues or the need for capacity optimization.", "service": "ec2"}, {"checkname": "publicAmi", "title": "Public AMI", "severity": "High", "description": "Checks for publicly shared AMIs", "more_info": "Accidentally sharing AMIs allows any AWS user to launch an EC2 instance using the image as a base. This can potentially expose sensitive information stored on the host.", "service": "ec2"}, {"checkname": "publicIpAddress", "title": "Public IP Address EC2 Instances", "severity": "High", "description": "Ensures that EC2 instances do not have public IP address attached.", "more_info": "EC2 instances should not have a public IP address attached in order to block public access to the instances.", "service": "ec2"}, {"checkname": "securityGroupRfc1918", "title": "Open RFC 1918", "severity": "Medium", "description": "Ensures EC2 security groups are configured to deny inbound traffic from RFC-1918 CIDRs", "more_info": "RFC-1918 IP addresses are considered reserved private addresses and should not be used in security groups.", "service": "ec2"}, {"checkname": "securityGroupsHasTags", "title": "Security Group Has Tags", "severity": "Low", "description": "Ensure that AWS Security Groups have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ec2"}, {"checkname": "subnetIpAvailability", "title": "Subnet IP Availability", "severity": "Medium", "description": "Determine if a subnet is at risk of running out of IP addresses", "more_info": "Subnets have finite IP addresses. Running out of IP addresses could prevent resources from launching.", "service": "ec2"}, {"checkname": "unassociatedElasticIp", "title": "Unassociated Elastic IP Addresses", "severity": "Medium", "description": "Ensures all EIPs are allocated to a resource to avoid accidental usage or reuse and to save costs", "more_info": "EIPs should be deleted if they are not in use to avoid extra charges.", "service": "ec2"}, {"checkname": "unusedAmi", "title": "Unused Amazon Machine Images", "severity": "Low", "description": "Ensures that all Amazon Machine Images are in use to ensure cost optimization.", "more_info": "All unused/deregistered Amazon Machine Images should be deleted to avoid extraneous cost.", "service": "ec2"}, {"checkname": "unusedEni", "title": "Unused Elastic Network Interfaces", "severity": "Low", "description": "Ensures that unused AWS Elastic Network Interfaces (ENIs) are removed.", "more_info": "Unused AWS ENIs should be removed to follow best practices and to avoid reaching the service limit.", "service": "ec2"}, {"checkname": "unusedSecurityGroups", "title": "Unused Security Groups", "severity": "Low", "description": "Identify and remove unused EC2 security groups.", "more_info": "Keeping the number of security groups to a minimum makes the management easier and helps to avoid reaching the service limit.", "service": "ec2"}, {"checkname": "unusedVirtualPrivateGateway", "title": "Unused Virtual Private Gateway", "severity": "Low", "description": "Ensures that unused Virtual Private Gateways (VGWs) are removed.", "more_info": "Unused VGWs should be remove to follow best practices and to avoid reaching the service limit.", "service": "ec2"}, {"checkname": "unusedVpcInternetGateways", "title": "Unused VPC Internet Gateways", "severity": "Low", "description": "Ensures that unused VPC Internet Gateways and Egress-Only Internet Gateways are removed.", "more_info": "Unused VPC Internet Gateways and Egress-Only Internet Gateways must be removed to avoid reaching the internet gateway limit.", "service": "ec2"}, {"checkname": "vpcElasticIpLimit", "title": "VPC Elastic IP Limit", "severity": "Medium", "description": "Determine if the number of allocated VPC EIPs is close to the AWS per-account limit", "more_info": "AWS limits accounts to certain numbers of resources. Exceeding those limits could prevent resources from launching.", "service": "ec2"}, {"checkname": "vpcEndpointAcceptance", "title": "VPC PrivateLink Endpoint Acceptance Required", "severity": "Medium", "description": "Ensures VPC PrivateLink endpoints require acceptance", "more_info": "VPC PrivateLink endpoints should be configured to require acceptance so that access to the endpoint is controlled on a case-by-case basis.", "service": "ec2"}, {"checkname": "vpcEndpointCrossAccount", "title": "VPC Endpoint Cross Account Access", "severity": "Medium", "description": "Ensures that Amazon VPC endpoints do not allow unknown cross account access.", "more_info": "VPC endpoints should not allow unknown cross account access to avoid any unsigned requests made to the services inside VPC.", "service": "ec2"}, {"checkname": "vpcEndpointExposed", "title": "VPC Endpoint Exposed", "severity": "Medium", "description": "Ensure Amazon VPC endpoints are not publicly exposed.", "more_info": "VPC endpoints should not be publicly accessible in order to avoid any unsigned requests made to the services inside VPC.", "service": "ec2"}, {"checkname": "vpcHasTags", "title": "VPC Has Tags", "severity": "Low", "description": "Ensure that AWS VPC have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ec2"}, {"checkname": "vpcPeeringConnections", "title": "Cross Organization VPC Peering Connections", "severity": "Medium", "description": "Ensures that VPC peering communication is only between AWS accounts, members of the same AWS Organization.", "more_info": "VPC peering communication should be only between AWS accounts to keep organization resources private and isolated.", "service": "ec2"}, {"checkname": "vpcSubnetInstancesPresent", "title": "VPC Subnet Instances Present", "severity": "Low", "description": "Ensures that there are instances attached to every subnet.", "more_info": "All subnets should have instances associated and unused subnets should be removed to avoid reaching the limit.", "service": "ec2"}, {"checkname": "vpnGatewayInVpc", "title": "Virtual Private Gateway In VPC", "severity": "Medium", "description": "Ensure Virtual Private Gateways are associated with at least one VPC.", "more_info": "", "service": "ec2"}, {"checkname": "vpnTunnelState", "title": "VPN Tunnel State", "severity": "Low", "description": "Ensures that each AWS Virtual Private Network (VPN) connection has all tunnels up.", "more_info": "AWS Virtual Private Network (VPN) should have tunnels up to ensure network traffic flow over Virtual Private Network.", "service": "ec2"}, {"checkname": "webTierInstanceIamRole", "title": "Web-Tier EC2 Instance IAM Role", "severity": "High", "description": "Ensure IAM roles attached with Web-Tier EC2 instances have IAM policies attached.", "more_info": "EC2 instances should have IAM roles configured with necessary permission to access other AWS services", "service": "ec2"}, {"checkname": "ecrImageVulnerability", "title": "Amazon ECR Scan on Push", "severity": "Medium", "description": "Ensures Amazon ECR container images are automatically scanned for security vulnerabilities after being pushed to a repository.", "more_info": "Scan on Push for Amazon ECR is an automated vulnerability assessment feature that helps improve the security of ECR container images by scanning them for OS vulnerabilities.", "service": "ecr"}, {"checkname": "ecrRepositoryEncrypted", "title": "ECR Repository Encrypted", "severity": "High", "description": "Ensure that the images in ECR repository are encrypted using desired encryption level.", "more_info": "", "service": "ecr"}, {"checkname": "ecrRepositoryHasTags", "title": "ECR Repository Has Tags", "severity": "Low", "description": "Ensure that Amazon ECR repositories have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ecr"}, {"checkname": "ecrRepositoryPolicy", "title": "ECR Repository Policy", "severity": "Low", "description": "Ensures ECR repository policies do not enable global or public access to images", "more_info": "ECR repository policies should limit access to images to known IAM entities and AWS accounts and avoid the use of account-level wildcards.", "service": "ecr"}, {"checkname": "ecrRepositoryTagImmutability", "title": "ECR Repository Tag Immutability", "severity": "Low", "description": "Ensures ECR repository image tags cannot be overwritten", "more_info": "ECR repositories should be configured to prevent overwriting of image tags to avoid potentially-malicious images from being deployed to live environments.", "service": "ecr"}, {"checkname": "ecsClusterActiveService", "title": "ECS Cluster Active Services", "severity": "Medium", "description": "Ensure that AWS ECS clusters have active services.", "more_info": "Amazon ECS service allows you to run and maintain a specified number of instances of a task definition simultaneously in an Amazon ECS cluster. It is recommended to have clusters with the active services to avoid any container attack surface.", "service": "ecs"}, {"checkname": "ecsClusterWithActiveTask", "title": "ECS Cluster Service Active Tasks", "severity": "Medium", "description": "Ensure ECS clusters have services with running tasks.", "more_info": "A task is the instantiation of a task definition within a cluster. Amazon ECS service instantiates and maintains the specified number of tasks simultaneously in a cluster. As a best practice, ensure you always have running tasks in a cluster.", "service": "ecs"}, {"checkname": "ecsClustersHaveTags", "title": "ECS Cluster Has Tags", "severity": "Low", "description": "Ensure that AWS ECS Clusters have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "ecs"}, {"checkname": "ecsContainerInsightsEnabled", "title": "Container Insights Enabled", "severity": "Low", "description": "Ensure that ECS clusters have CloudWatch Container Insights feature enabled.", "more_info": "CloudWatch Container Insights provides monitoring and troubleshooting solution for containerized applications and microservices that collects, aggregates and summarizes resource utilization such as CPU, memory, disk, and network.", "service": "ecs"}, {"checkname": "efsCmkEncrypted", "title": "EFS CMK Encrypted", "severity": "High", "description": "Ensure EFS file systems are encrypted using Customer Master Keys (CMKs).", "more_info": "EFS file systems should use KMS Customer Master Keys (CMKs) instead of AWS managed keys for encryption in order to have full control over data encryption and decryption.", "service": "efs"}, {"checkname": "efsEncryptionEnabled", "title": "EFS Encryption Enabled", "severity": "High", "description": "Ensures that EFS volumes are encrypted at rest", "more_info": "EFS offers data at rest encryption using keys managed through AWS Key Management Service (KMS).", "service": "efs"}, {"checkname": "efsHasTags", "title": "EFS Has Tags", "severity": "Low", "description": "Ensure that AWS EFS file systems have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "efs"}, {"checkname": "eksClusterHasTags", "title": "EKS Cluster Has Tags", "severity": "Low", "description": "Ensure that AWS EKS Clusters have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "eks"}, {"checkname": "eksKubernetesVersion", "title": "EKS Kubernetes Version", "severity": "Low", "description": "Ensures the latest version of Kubernetes is installed on EKS clusters", "more_info": "EKS supports provisioning clusters from several versions of Kubernetes. Clusters should be kept up to date to ensure Kubernetes security patches are applied.", "service": "eks"}, {"checkname": "eksLatestPlatformVersion", "title": "EKS Latest Platform Version", "severity": "Low", "description": "Ensure that EKS clusters are using latest platform version.", "more_info": "", "service": "eks"}, {"checkname": "eksLoggingEnabled", "title": "EKS Logging Enabled", "severity": "Low", "description": "Ensures all EKS cluster logs are being sent to CloudWatch", "more_info": "EKS supports routing of cluster event and audit logs to CloudWatch, including control plane logs. All logs should be sent to CloudWatch for security analysis.", "service": "eks"}, {"checkname": "eksPrivateEndpoint", "title": "EKS Private Endpoint", "severity": "Medium", "description": "Ensures the private endpoint setting is enabled for EKS clusters", "more_info": "EKS private endpoints can be used to route all traffic between the Kubernetes worker and control plane nodes over a private VPC endpoint rather than across the public internet.", "service": "eks"}, {"checkname": "eksSecretsEncrypted", "title": "EKS Secrets Encrypted", "severity": "High", "description": "Ensures EKS clusters are configured to enable envelope encryption of Kubernetes secrets using KMS.", "more_info": "Amazon EKS clusters should be configured to enable envelope encryption for Kubernetes secrets to adhere to security best practice for applications that store sensitive data.", "service": "eks"}, {"checkname": "eksSecurityGroups", "title": "EKS Security Groups", "severity": "Medium", "description": "Ensures the EKS control plane only allows inbound traffic on port 443.", "more_info": "The EKS control plane only requires port 443 access. Security groups for the control plane should not add additional port access.", "service": "eks"}, {"checkname": "elasticCacheClusterHasTags", "title": "ElastiCache Cluster Has Tags", "severity": "Low", "description": "Ensure that ElastiCache clusters have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "elasticache"}, {"checkname": "elasticacheClusterInVpc", "title": "ElastiCache Cluster In VPC", "severity": "Medium", "description": "Ensure that your ElastiCache clusters are provisioned within the AWS VPC platform.", "more_info": "Creating Amazon ElastiCache clusters inside Amazon VPC can bring multiple advantages such as better networking infrastructure and flexible control over access security .", "service": "elasticache"}, {"checkname": "elasticacheDefaultPorts", "title": "ElastiCache Default Ports", "severity": "Low", "description": "Ensure AWS ElastiCache clusters are not using the default ports set for Redis and Memcached cache engines.", "more_info": "ElastiCache clusters should be configured not to use the default assigned port value for Redis (6379) and Memcached (11211).", "service": "elasticache"}, {"checkname": "elasticacheInstanceGeneration", "title": "ElastiCache Instance Generation", "severity": "Medium", "description": "Ensure that all ElastiCache clusters provisioned within your AWS account are using the latest generation of instances", "more_info": "", "service": "elasticache"}, {"checkname": "elasticacheNodesCount", "title": "ElastiCache Nodes Count", "severity": "Medium", "description": "Ensure that the number of ElastiCache cluster cache nodes has not reached the limit quota established by your organization.", "more_info": "Defining limits for the maximum number of ElastiCache cluster nodes that can be created within your AWS account will help you to better manage your ElastiCache compute resources and prevent unexpected charges on your AWS bill.", "service": "elasticache"}, {"checkname": "elasticacheRedisMultiAZ", "title": "ElastiCache Redis Cluster Have Multi-AZ", "severity": "Medium", "description": "Ensure that your ElastiCache Redis Cache clusters are using a Multi-AZ deployment configuration to enhance High Availability.", "more_info": "Enabling the Multi-AZ feature for your Redis Cache clusters will improve the fault tolerance in case the read/write primary node becomes unreachable due to loss of network connectivity, loss of availability in the primary’s AZ, etc. ", "service": "elasticache"}, {"checkname": "elasticaheDesiredNodeType", "title": "ElastiCache Desired Node Type", "severity": "Medium", "description": "Ensure that the Amazon ElastiCache cluster nodes provisioned in your AWS account have the desired node type established within your organization based on the workload deployed.", "more_info": "Setting limits for the type of Amazon ElastiCache cluster nodes will help you address internal compliance requirements and prevent unexpected charges on your AWS bill.", "service": "elasticache"}, {"checkname": "idleElastiCacheNode", "title": "ElastiCache idle Cluster Status", "severity": "High", "description": "Identify ElastiCache clusters having CPU utilization below defined threshold within last 24 hours (idle clusters).", "more_info": "Idle Amazon ElastiCache cache cluster nodes represent a good candidate to reduce your monthly AWS costs and avoid accumulating unnecessary usage charges.", "service": "elasticache"}, {"checkname": "redisClusterEncryptionAtRest", "title": "ElastiCache Redis Cluster Encryption At-Rest", "severity": "High", "description": "Ensure that your Amazon ElastiCache Redis clusters are encrypted to increase data security.", "more_info": "", "service": "elasticache"}, {"checkname": "redisClusterEncryptionInTransit", "title": "ElastiCache Redis Cluster Encryption In-Transit", "severity": "High", "description": "Ensure that your AWS ElastiCache Redis clusters have encryption in-transit enabled.", "more_info": "Amazon ElastiCache in-transit encryption is an optional feature that allows you to increase the security of your data at its most vulnerable points—when it is in transit from one location to another.", "service": "elasticache"}, {"checkname": "redisEngineVersions", "title": "ElastiCache Engine Versions for Redis", "severity": "Medium", "description": "Ensure that Amazon ElastiCache clusters are using the stable latest version of Redis cache engine.", "more_info": "", "service": "elasticache"}, {"checkname": "reservedNodeLeaseExpiration", "title": "ElastiCache Reserved Cache Node Lease Expiration", "severity": "Medium", "description": "Ensure that your AWS ElastiCache Reserved Cache Nodes are renewed before expiration in order to get a significant discount.", "more_info": "Reserved Cache Nodes can optimize your Amazon ElastiCache costs based on your expected usage. Since RCNs are not renewed automatically, purchasing another reserved ElastiCache nodes before expiration will guarantee their billing at a discounted hourly rate.", "service": "elasticache"}, {"checkname": "reservedNodePaymentFailed", "title": "ElastiCache Reserved Cache Node Payment Failed", "severity": "High", "description": "Ensure that payments for ElastiCache Reserved Cache Nodes available within your AWS account has been processed completely. ", "more_info": "When using ElastiCache Reserved Cache Nodes over standard On-Demand Cache Nodes savings are up to max that they give when used in steady state, therefore in order to receive this benefit you need to make sure that all your ElastiCache reservation purchases have been fully successful.", "service": "elasticache"}, {"checkname": "reservedNodePaymentPending", "title": "ElastiCache Reserved Cache Node Payment Pending", "severity": "High", "description": "Ensure that payments for ElastiCache Reserved Cache Nodes available within your AWS account has been processed completely. ", "more_info": "When using ElastiCache Reserved Cache Nodes over standard On-Demand Cache Nodes savings are up to max that they give when used in steady state, therefore in order to receive this benefit you need to make sure that all your ElastiCache reservation purchases have been fully successful.", "service": "elasticache"}, {"checkname": "unusedElastiCacheReservedNode", "title": "Unused ElastiCache Reserved Cache Nodes", "severity": "High", "description": "Ensure that all your AWS ElastiCache reserved nodes have corresponding cache nodes running within the same account of an AWS Organization.", "more_info": "Creating cache nodes for your unused reserved cache clusters will prevent your investment having a negative return. When an Amazon ElastiCache RCN is not in use the investment made is not properly exploited.", "service": "elasticache"}, {"checkname": "enhancedHealthReporting", "title": "Enhanced Health Reporting", "severity": "Medium", "description": "Ensure that Amazon Elastic Beanstalk (EB) environments have enhanced health reporting feature enabled.", "more_info": "", "service": "elasticbeanstalk"}, {"checkname": "environmentAccessLogs", "title": "Environment Access Logs", "severity": "Medium", "description": "Ensure that your Amazon Elastic Beanstalk environment is configured to save logs for load balancer associated with the application environment.", "more_info": "", "service": "elasticbeanstalk"}, {"checkname": "environmentPersistentLogs", "title": "Environment Persistent Logs", "severity": "Medium", "description": "Ensure that AWS Elastic Beanstalk environment logs are retained and saved on S3.", "more_info": "Elastic Beanstalk environment logs should be retained in order to keep the logging data for future audits, historical purposes or to track and analyze the EB application environment behavior for a long period of time.", "service": "elasticbeanstalk"}, {"checkname": "managedPlatformUpdates", "title": "ElasticBeanstalk Managed Platform Updates", "severity": "Medium", "description": "Ensures ElasticBeanstalk applications are configured to use managed updates.", "more_info": "Environments for an application should be configured to allow platform managed updates.", "service": "elasticbeanstalk"}, {"checkname": "jobOutputsEncrypted", "title": "Elastic Transcoder Job Outputs Encrypted", "severity": "High", "description": "Ensure that Elastic Transcoder jobs have encryption enabled to encrypt your data before saving on S3.", "more_info": "", "service": "elastictranscoder"}, {"checkname": "pipelineDataEncrypted", "title": "Elastic Transcoder Pipeline Data Encrypted", "severity": "High", "description": "Ensure that Elastic Transcoder pipelines have encryption enabled with desired encryption level to encrypt your data.", "more_info": "", "service": "elastictranscoder"}, {"checkname": "appTierElbSecurity", "title": "App-Tier ELB Security Policy", "severity": "Medium", "description": "Ensures that AWS App-Tier ELBs are using the latest predefined security policies.", "more_info": "AWS App-Tier ELBs should use the latest predefined security policies to secure the connection between client and ELB.", "service": "elb"}, {"checkname": "classicELBInUse", "title": "Classic Load Balancers In Use", "severity": "Medium", "description": "Ensures that HTTP/HTTPS applications are using Application Load Balancer instead of Classic Load Balancer.", "more_info": "HTTP/HTTPS applications should use Application Load Balancer instead of Classic Load Balancer for cost and web traffic distribution optimization.", "service": "elb"}, {"checkname": "connectionDrainingEnabled", "title": "ELB Connection Draining Enabled", "severity": "Medium", "description": "Ensures that AWS ELBs have connection draining enabled.", "more_info": "Connection draining should be used to ensure that a Classic Load Balancer stops sending requests to instances that are de-registering or unhealthy, while keeping the existing connections open.", "service": "elb"}, {"checkname": "crosszoneLoadBalancing", "title": "ELB Cross-Zone Load Balancing", "severity": "Medium", "description": "Ensures that AWS ELBs have cross-zone load balancing enabled.", "more_info": "AWS ELBs should have cross-zone load balancing enabled to distribute the traffic evenly across the registered instances in all enabled Availability Zones.", "service": "elb"}, {"checkname": "elbHasTags", "title": "ELB Has Tags", "severity": "Low", "description": "Ensure that ELBs have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "elb"}, {"checkname": "elbHttpsOnly", "title": "ELB HTTPS Only", "severity": "Medium", "description": "All HTTP Listeners will be deleted", "more_info": "", "service": "elb"}, {"checkname": "elbLoggingEnabled", "title": "ELB Logging Enabled", "severity": "Medium", "description": "Ensures load balancers have request logging enabled.", "more_info": "", "service": "elb"}, {"checkname": "elbNoInstances", "title": "ELB No Instances", "severity": "Medium", "description": "Detects ELBs that have no backend instances attached", "more_info": "", "service": "elb"}, {"checkname": "elbUnhealthyInstances", "title": "ELB Unhealthy Instances", "severity": "High", "description": "Ensures that AWS ELBs have healthy instances attached", "more_info": "ELBs should have healthy instances attached to ensure proper load balancing and availability. The status of the instances that are healthy should be InService.", "service": "elb"}, {"checkname": "insecureCiphers", "title": "Insecure Ciphers", "severity": "Medium", "description": "Detect use of insecure ciphers on ELBs", "more_info": "Various security vulnerabilities have rendered several ciphers insecure. Only the recommended ciphers should be used.", "service": "elb"}, {"checkname": "elbv2DeletionProtection", "title": "ELBv2 Deletion Protection", "severity": "Medium", "description": "Ensures ELBv2 load balancers are configured with deletion protection.", "more_info": "", "service": "elbv2"}, {"checkname": "elbv2DeprecatedSslPolicies", "title": "ELBv2 Deprecated SSL Policies", "severity": "Medium", "description": "Ensure that Elbv2 listeners are configured to use the latest predefined security policies.", "more_info": "Insecure or deprecated security policies can expose the client and the load balancer to various vulnerabilities.", "service": "elbv2"}, {"checkname": "elbv2DeregistrationDelay", "title": "ELBv2 Deregistration Delay", "severity": "Medium", "description": "Ensures that AWS ELBv2 target groups have deregistration delay configured.", "more_info": "AWS ELBv2 target groups should have deregistration delay configured to help in-flight requests to the target to complete.", "service": "elbv2"}, {"checkname": "elbv2HasTags", "title": "ELBv2 Has Tags", "severity": "Low", "description": "Ensure that ELBv2 load balancers have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "elbv2"}, {"checkname": "elbv2HttpsOnly", "title": "ELBv2 HTTPS Only", "severity": "Medium", "description": "All HTTP Listeners will be deleted", "more_info": "", "service": "elbv2"}, {"checkname": "elbv2InsecureCiphers", "title": "ELBv2 Insecure Ciphers", "severity": "Medium", "description": "Ensure that Elbv2 listeners are configured to use the predefined security policies containing secure ciphers.", "more_info": "A security policy is a combination of protocols and ciphers. The protocol establishes a secure connection between a client and a server and ensures that all data passed between the client and your load balancer is private.", "service": "elbv2"}, {"checkname": "elbv2LoggingEnabled", "title": "ELBv2 Logging Enabled", "severity": "Medium", "description": "Ensures load balancers have request logging enabled.", "more_info": "", "service": "elbv2"}, {"checkname": "elbv2MinimumTargetInstances", "title": "ELBv2 Minimum Number of EC2 Target Instances", "severity": "High", "description": "Ensures that there is a minimum number of two healthy target instances associated with each AWS ELBv2 load balancer.", "more_info": "There should be a minimum number of two healthy target instances associated with each AWS ELBv2 load balancer to ensure fault tolerance.", "service": "elbv2"}, {"checkname": "elbv2NlbListenerSecurity", "title": "ELBv2 NLB Listener Security", "severity": "High", "description": "Ensures that AWS Network Load Balancers have secured listener configured.", "more_info": "AWS Network Load Balancer should have TLS protocol listener configured to terminate TLS traffic.", "service": "elbv2"}, {"checkname": "elbv2NoInstances", "title": "ELBv2 No Instances", "severity": "Medium", "description": "Detects ELBs that have no target groups attached", "more_info": "", "service": "elbv2"}, {"checkname": "elbv2SslTermination", "title": "ELB SSL Termination", "severity": "Medium", "description": "Ensure that Load Balancers has SSL certificate configured for SSL terminations.", "more_info": "SSL termination or SSL offloading decrypts and verifies data on the load balancer instead of the application server which spares the server of having to organize incoming connections and prioritize on other tasks like loading web pages. This helps increase server speed.", "service": "elbv2"}, {"checkname": "elbv2TLSVersionCipherEnabled", "title": "ELBv2 TLS Version and Cipher Header Enabled", "severity": "Medium", "description": "Ensures that AWS ELBv2 load balancers have TLS version and cipher headers enabled.", "more_info": "ELBv2 load balancers should be configured with TLS version and cipher headers for security compliance and best practices.", "service": "elbv2"}, {"checkname": "elbv2UnhealthyInstance", "title": "ELBv2 Unhealthy Instances", "severity": "High", "description": "Ensures that ELBv2 have healthy instances attached", "more_info": "", "service": "elbv2"}, {"checkname": "elbv2WafEnabled", "title": "ELBv2 WAF Enabled", "severity": "Medium", "description": "Ensure that all Application Load Balancers have WAF enabled.", "more_info": "Enabling WAF allows control over requests to the load balancer, allowing or denying traffic based off rules in the Web ACL", "service": "elbv2"}, {"checkname": "elbv2crosszoneLoadBalancing", "title": "ELBv2 Cross-Zone Load Balancing", "severity": "Medium", "description": "Ensures that AWS ELBv2 load balancers have cross-zone load balancing enabled.", "more_info": "AWS ELBv2 should have cross-zone load balancing enabled to distribute the traffic evenly across the registered instances in all enabled Availability Zones.", "service": "elbv2"}, {"checkname": "emrClusterHasTags", "title": "EMR Cluster Has Tags", "severity": "Low", "description": "Ensure that EMR clusters have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "emr"}, {"checkname": "emrClusterInVPC", "title": "EMR Cluster In VPC", "severity": "Medium", "description": "Ensure that your Amazon Elastic MapReduce (EMR) clusters are provisioned using the AWS VPC platform instead of EC2-Classic platform.", "more_info": "AWS EMR clusters using VPC platform instead of EC2-Classic can bring multiple advantages such as better networking infrastructure, much more flexible control over access security .", "service": "emr"}, {"checkname": "emrClusterLogging", "title": "EMR Cluster Logging", "severity": "Low", "description": "Ensure AWS Elastic MapReduce (EMR) clusters capture detailed log data to Amazon S3.", "more_info": "EMR cluster logging should be enabled to save log files for troubleshooting purposes.", "service": "emr"}, {"checkname": "emrDesiredInstanceType", "title": "EMR Cluster Desired Instance Type", "severity": "Medium", "description": "Ensure AWS Elastic MapReduce (EMR) clusters are using desired instance type.", "more_info": "EMR cluster desired instance should be enabled  to get the desired instance type.", "service": "emr"}, {"checkname": "emrEncryptionAtRest", "title": "EMR Encryption At Rest", "severity": "High", "description": "Ensures encryption at rest for local disks is enabled for EMR clusters", "more_info": "EMR clusters should be configured to enable encryption at rest for local disks.", "service": "emr"}, {"checkname": "emrEncryptionInTransit", "title": "EMR Encryption In Transit", "severity": "High", "description": "Ensures encryption in transit is enabled for EMR clusters", "more_info": "EMR clusters should be configured to enable encryption in transit.", "service": "emr"}, {"checkname": "emrInstanceCount", "title": "EMR Instances Counts", "severity": "Medium", "description": "Ensure that the number of EMR cluster instances provisioned in your AWS account has not reached the desired threshold established by your organization.", "more_info": "", "service": "emr"}, {"checkname": "eventBusCrossAccountAccess", "title": "Event Bus Cross Account Access", "severity": "Low", "description": "Ensure that EventBridge event bus is configured to allow access to whitelisted AWS account principals.", "more_info": "EventBridge event bus policy should be configured to allow access only to whitelisted/trusted cross-account principals.", "service": "eventbridge"}, {"checkname": "eventBusPublicAccess", "title": "Event Bus Public Access", "severity": "High", "description": "Ensure that EventBridge event bus is configured to prevent exposure to public access.", "more_info": "The default event bus in your Amazon account only allows events from one account. You can grant additional permissions to an event bus by attaching a resource-based policy to it.", "service": "eventbridge"}, {"checkname": "eventsInUse", "title": "EventBridge Event Rules In Use", "severity": "Low", "description": "Ensure that Amazon EventBridge Events service is in use in order to enable you to react selectively and efficiently to system events.", "more_info": "Amazon EventBridge Events delivers a near real-time stream of system events that describe changes in Amazon Web Services (AWS) resources. Using simple rules that you can quickly set up, you can match events and route them to one or more target functions or streams.", "service": "eventbridge"}, {"checkname": "finspaceEnvironmentEncrypted", "title": "FinSpace Environment Encrypted", "severity": "High", "description": "Ensure that AWS FinSpace Environments are using desired encryption level.", "more_info": "", "service": "finspace"}, {"checkname": "deliveryStreamEncrypted", "title": "Firehose Delivery Stream Destination CMK Encrypted", "severity": "High", "description": "Ensures Firehose delivery stream data records are encrypted at destination bucket using AWS KMS key of desired encryption level.", "more_info": "Encrypting Kinesis Firehose delivery stream data records at the destination S3 bucket is crucial for compliance and data security. This ensures that data is protected at rest, meeting regulatory requirements and providing an additional layer of security, essential for organizations with strict data protection mandates.", "service": "firehose"}, {"checkname": "firehoseEncrypted", "title": "Firehose Delivery Streams Encrypted", "severity": "High", "description": "Ensures Firehose Delivery Stream encryption is enabled", "more_info": "Data sent through Firehose Delivery Streams can be encrypted using KMS server-side encryption. Existing delivery streams can be modified to add encryption with minimal overhead.", "service": "firehose"}, {"checkname": "datasetExportEncrypted", "title": "Forecast Dataset Export Encrypted", "severity": "High", "description": "Ensure that AWS Forecast exports have encryption enabled before they are being saved on S3.", "more_info": "", "service": "forecast"}, {"checkname": "forecastDatasetEncrypted", "title": "Forecast Dataset Encrypted", "severity": "High", "description": "Ensure that AWS Forecast datasets are using desired KMS key for data encryption.", "more_info": "", "service": "forecast"}, {"checkname": "fraudDetectorDataEncrypted", "title": "Fraud Detector Data Encrypted", "severity": "High", "description": "Ensure that Amazon Fraud Detector has encryption enabled for data at rest with desired KMS encryption level.", "more_info": "", "service": "frauddetector"}, {"checkname": "fsxFileSystemEncrypted", "title": "FSx File System Encrypted", "severity": "High", "description": "Ensure that Amazon FSx for Windows File Server file systems are encrypted using desired KMS encryption level.", "more_info": "If your organization is subject to corporate or regulatory policies that require encryption of data and metadata at rest, AWS recommends creating encrypted file systems.", "service": "fsx"}, {"checkname": "bookmarkEncryptionEnabled", "title": "AWS Glue Job Bookmark Encryption Enabled", "severity": "High", "description": "Ensures that AWS Glue job bookmark encryption is enabled.", "more_info": "AWS Glue security configuration should have job bookmark encryption enabled in order to encrypt the bookmark data before it is sent to Amazon S3.", "service": "glue"}, {"checkname": "dataCatalogCmkEncrypted", "title": "AWS Glue Data Catalog CMK Encrypted", "severity": "High", "description": "Ensures that AWS Glue has data catalog encryption enabled with KMS Customer Master Key (CMK).", "more_info": "AWS Glue should have data catalog encryption enabled with KMS Customer Master Key (CMK) instead of AWS-managed Key in order to gain more granular control over encryption/decryption process.", "service": "glue"}, {"checkname": "dataCatalogEncryptionEnabled", "title": "AWS Glue Data Catalog Encryption Enabled", "severity": "High", "description": "Ensures that AWS Glue Data Catalogs has encryption at-rest enabled.", "more_info": "Encryption should be enabled for metadata objects stored in your AWS Glue Data Catalog to secure sensitive data.", "service": "glue"}, {"checkname": "glueCloudwatchLogsEncrypted", "title": "AWS Glue CloudWatch Encrypted Logs", "severity": "High", "description": "Ensures that encryption at-rest is enabled when writing AWS Glue logs to Amazon CloudWatch.", "more_info": "AWS Glue should have encryption at-rest enabled for AWS Glue logs to ensure security of AWS Glue logs.", "service": "glue"}, {"checkname": "glueS3EncryptionEnabled", "title": "AWS Glue S3 Encryption Enabled", "severity": "High", "description": "Ensures that encryption at-rest is enabled when writing AWS Glue data to Amazon S3.", "more_info": "AWS Glue should have encryption at-rest enabled for Amazon S3 to ensure security of data at rest and to prevent unauthorized access.", "service": "glue"}, {"checkname": "databrewJobOutputEncrypted", "title": "AWS Glue DataBrew Job Output Encrypted", "severity": "High", "description": "Ensure that AWS Glue DataBrew jobs have encryption enabled for output files with desired encryption level.", "more_info": "AWS Glue DataBrew jobs should have encryption enabled to encrypt S3 targets i.e. output files to meet regulatory compliance requirements within your organization.", "service": "gluedatabrew"}, {"checkname": "exportedFindingsEncrypted", "title": "Exported Findings Encrypted", "severity": "High", "description": "Ensure that GuardDuty findings export is encrypted using desired KMS encryption level.", "more_info": "", "service": "guardduty"}, {"checkname": "guarddutyEnabled", "title": "GuardDuty is Enabled", "severity": "Medium", "description": "Ensures GuardDuty is enabled", "more_info": "GuardDuty provides threat intelligence by analyzing several AWS data sources for security risks and should be enabled in all accounts.", "service": "guardduty"}, {"checkname": "guarddutyMaster", "title": "GuardDuty Master Account", "severity": "Medium", "description": "Ensures GuardDuty master account is correct", "more_info": "Organizations with large numbers of AWS accounts should configure GuardDuty findings from all member accounts to be sent to a consistent master account.", "service": "guardduty"}, {"checkname": "noActiveFindings", "title": "GuardDuty No Active Findings", "severity": "Medium", "description": "Ensure that GurardDuty active/current findings does not exist in your AWS account.", "more_info": "", "service": "guardduty"}, {"checkname": "rdsProtectionEnabled", "title": "GuardDuty RDS Protection Enabled", "severity": "Medium", "description": "", "more_info": "Enabling GuardDuty RDS Protection helps analyze RDS login activity to identify access threats, offering enhanced security. It enables proactive threat detection, automated alerting, and flexible configuration for AWS accounts.", "service": "guardduty"}, {"checkname": "s3ProtectionEnabled", "title": "S3 GuardDuty Enabled", "severity": "Medium", "description": "", "more_info": "Enabling GuardDuty S3 protection helps to detect and prevent unauthorized access to your S3 buckets.", "service": "guardduty"}, {"checkname": "dataStoreEncrypted", "title": "HealthLake Data Store Encrypted", "severity": "High", "description": "Ensure that AWS HealthLake Data Store is using desired encryption level.", "more_info": "", "service": "healthlake"}, {"checkname": "accessKeysExtra", "title": "Access Keys Extra", "severity": "Medium", "description": "Detects the use of more than one access key by any single user", "more_info": "Having more than one access key for a single user increases the chance of accidental exposure. Each account should only have one key that defines the users permissions.", "service": "iam"}, {"checkname": "accessKeysLastUsed", "title": "Access Keys Last Used", "severity": "Medium", "description": "Detects access keys that have not been used for a period of time and that should be decommissioned", "more_info": "Having numerous, unused access keys extends the attack surface. Access keys should be removed if they are no longer being used.", "service": "iam"}, {"checkname": "accessKeysRotated", "title": "Access Keys Rotated", "severity": "Low", "description": "Ensures access keys are not older than 180 days in order to reduce accidental exposures", "more_info": "Access keys should be rotated frequently to avoid having them accidentally exposed.", "service": "iam"}, {"checkname": "canaryKeysUsed", "title": "Canary Keys Used", "severity": "Critical", "description": "Detects when a special canary-token access key has been used", "more_info": "Canary access keys can be created with limited permissions and then used to detect when a potential breach occurs.", "service": "iam"}, {"checkname": "certificateExpiry", "title": "Certificate Expiry", "severity": "Low", "description": "Detect upcoming expiration of certificates used with ELBs", "more_info": "Certificates that have expired will trigger warnings in all major browsers", "service": "iam"}, {"checkname": "crossAccountMfaExtIdAccess", "title": "Cross-Account Access External ID and MFA", "severity": "Medium", "description": "Ensures that either MFA or external IDs are used to access AWS roles.", "more_info": "IAM roles should be configured to require either a shared external ID or use an MFA device when assuming the role.", "service": "iam"}, {"checkname": "emptyGroups", "title": "Empty Groups", "severity": "Low", "description": "Ensures all groups have at least one member", "more_info": "While having empty groups does not present a direct security risk, it does broaden the management landscape which could potentially introduce risks in the future.", "service": "iam"}, {"checkname": "groupInlinePolicies", "title": "Group Inline Policies", "severity": "Low", "description": "Ensures that groups do not have any inline policies", "more_info": "Managed Policies are recommended over inline policies.", "service": "iam"}, {"checkname": "iamMasterManagerRoles", "title": "IAM Master and IAM Manager Roles", "severity": "High", "description": "Ensure IAM Master and IAM Manager roles are active within your AWS account.", "more_info": "IAM roles should be split into IAM Master and IAM Manager roles to work in two-person rule manner for best prectices.", "service": "iam"}, {"checkname": "iamPoliciesPresent", "title": "IAM Policies Present", "severity": "Low", "description": "Ensure that required policies are present in all IAM roles.", "more_info": "", "service": "iam"}, {"checkname": "iamRoleHasTags", "title": "IAM Role Has Tags", "severity": "Low", "description": "Ensure that AWS IAM Roles have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "iam"}, {"checkname": "iamRoleLastUsed", "title": "IAM Role Last Used", "severity": "Low", "description": "Ensures IAM roles that have not been used within the given time frame are deleted.", "more_info": "IAM roles that have not been used for a long period may contain old access policies that could allow unintended access to resources if accidentally attached to new services. These roles should be deleted.", "service": "iam"}, {"checkname": "iamRolePolicies", "title": "IAM Role Policies", "severity": "Medium", "description": "Ensures IAM role policies are properly scoped with specific permissions", "more_info": "Policies attached to IAM roles should be scoped to least-privileged access and avoid the use of wildcards.", "service": "iam"}, {"checkname": "iamSupportPolicy", "title": "IAM Support Policy", "severity": "Medium", "description": "Ensures that an IAM role, group or user exists with specific permissions to access support center.", "more_info": "AWS provides a support center that can be used for incident notification and response, as well as technical support and customer services. An IAM Role should be present to allow authorized users to manage incidents with AWS Support.", "service": "iam"}, {"checkname": "iamUserAdmins", "title": "IAM User Admins", "severity": "High", "description": "Ensures the number of IAM admins in the account are minimized", "more_info": "While at least two IAM admin users should be configured, the total number of admins should be kept to a minimum.", "service": "iam"}, {"checkname": "iamUserHasTags", "title": "IAM User Has Tags", "severity": "Low", "description": "Ensure that AWS IAM Users have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "iam"}, {"checkname": "iamUserInUse", "title": "IAM User Account In Use", "severity": "Medium", "description": "Ensure that IAM user accounts are not being actively used.", "more_info": "IAM users, roles, and groups should not be used for day-to-day account management.", "service": "iam"}, {"checkname": "iamUserNameRegex", "title": "IAM Username Matches Regex", "severity": "Medium", "description": "Ensures all IAM user names match the given regex", "more_info": "Many organizational policies require IAM user names to follow a common naming convention. This check ensures these conventions are followed.", "service": "iam"}, {"checkname": "iamUserNotInUse", "title": "IAM User Account Not In Use", "severity": "Medium", "description": "Ensure that IAM user accounts are being actively used.", "more_info": "To increase the security of your AWS account, remove IAM user accounts that have not been used over a certain period of time.", "service": "iam"}, {"checkname": "iamUserPresent", "title": "IAM User Present", "severity": "Medium", "description": "Ensure that at least one IAM user exists so that access to your AWS services and resources is made only through IAM users instead of the root account.", "more_info": "To protect your AWS root account and adhere to IAM security best practices, create individual IAM users to access your AWS environment.", "service": "iam"}, {"checkname": "iamUserUnauthorizedToEdit", "title": "IAM User Unauthorized to Edit", "severity": "High", "description": "Ensures AWS IAM users that are not authorized to edit IAM access policies are decommissioned.", "more_info": "Only authorized IAM users should have permission to edit IAM access policies to prevent any unauthorized requests.", "service": "iam"}, {"checkname": "iamUserWithoutPermissions", "title": "IAM User Without Permissions", "severity": "Medium", "description": "Ensure that no IAM user exists without any permissions.", "more_info": "IAM users are created to perform any Console, CLI or API based operations on AWS cloud accounts. They are associated with policies that grant them permissions to perform required operations. An IAM user without any permission is a security risk, it is recommended to either add required permissions or delete them to adhere to compliance standards.", "service": "iam"}, {"checkname": "maxPasswordAge", "title": "Maximum Password Age", "severity": "Medium", "description": "Ensures password policy requires passwords to be reset every 180 days", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "minPasswordLength", "title": "Minimum Password Length", "severity": "Medium", "description": "Ensures password policy requires a password of at least a minimum number of characters", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "noUserIamPolicies", "title": "No User IAM Policies", "severity": "Low", "description": "Ensures IAM policies are not connected directly to IAM users", "more_info": "To reduce management complexity, IAM permissions should only be assigned to roles and groups. Users can then be added to those groups. Policies should not be applied directly to a user.", "service": "iam"}, {"checkname": "passwordExpiration", "title": "Password Expiration", "severity": "Medium", "description": "Ensures password policy enforces a password expiration", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "passwordPolicyExists", "title": "Password Policy Exists", "severity": "Medium", "description": "Ensures that password policy is set for IAM users.", "more_info": "", "service": "iam"}, {"checkname": "passwordRequiresLowercase", "title": "Password Requires Lowercase", "severity": "Medium", "description": "Ensures password policy requires at least one lowercase letter", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "passwordRequiresNumbers", "title": "Password Requires Numbers", "severity": "Medium", "description": "Ensures password policy requires the use of numbers", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "passwordRequiresSymbols", "title": "Password Requires Symbols", "severity": "Medium", "description": "Ensures password policy requires the use of symbols", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "passwordRequiresUppercase", "title": "Password Requires Uppercase", "severity": "Medium", "description": "Ensures password policy requires at least one uppercase letter", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "passwordReusePrevention", "title": "Password Reuse Prevention", "severity": "Medium", "description": "Ensures password policy prevents previous password reuse", "more_info": "A strong password policy enforces minimum length, expirations, reuse, and symbol usage", "service": "iam"}, {"checkname": "policyAllowsToChangePassword", "title": "Password Policy Allows To Change Password", "severity": "Medium", "description": "Ensure IAM password policy allows users to change their passwords.", "more_info": "Password policy should allow users to rotate their passwords as a security best practice.", "service": "iam"}, {"checkname": "rolePolicyUnusedServices", "title": "IAM Role Policy Unused Services", "severity": "Low", "description": "Ensure that IAM role policies are scoped properly as to not provide access to unused AWS services.", "more_info": "IAM role policies should only contain actions for resource types which are being used in your account i.e. dynamodb:ListTables permission should only be given when there are DynamoDB tables to adhere to security best practices and to follow principal of least-privilege.", "service": "iam"}, {"checkname": "rootAccessKeys", "title": "Root Access Keys", "severity": "High", "description": "Ensures the root account is not using access keys", "more_info": "The root account should avoid using access keys. Since the root account has full permissions across the entire account, creating access keys for it only increases the chance that they are compromised. Instead, create IAM users with predefined roles.", "service": "iam"}, {"checkname": "rootAccountInUse", "title": "Root Account In Use", "severity": "High", "description": "Ensures the root account is not being actively used", "more_info": "The root account should not be used for day-to-day account management. IAM users, roles, and groups should be used instead.", "service": "iam"}, {"checkname": "rootHardwareMfa", "title": "Root Hardware MFA", "severity": "High", "description": "Ensures the root account is using a hardware MFA device", "more_info": "The root account should use a hardware MFA device for added security, rather than a virtual device which could be more easily compromised.", "service": "iam"}, {"checkname": "rootMfaEnabled", "title": "Root MFA Enabled", "severity": "High", "description": "Ensures a multi-factor authentication device is enabled for the root account", "more_info": "The root account should have an MFA device setup to enable two-factor authentication.", "service": "iam"}, {"checkname": "rootSigningCertificate", "title": "Root Account Active Signing Certificates", "severity": "Low", "description": "Ensures the root user is not using x509 signing certificates", "more_info": "AWS supports using x509 signing certificates for API access, but these should not be attached to the root user, which has full access to the account.", "service": "iam"}, {"checkname": "sshKeysRotated", "title": "SSH Keys Rotated", "severity": "Low", "description": "Ensures SSH keys are not older than 180 days in order to reduce accidental exposures", "more_info": "SSH keys should be rotated frequently to avoid having them accidentally exposed.", "service": "iam"}, {"checkname": "trustedCrossAccountRoles", "title": "Trusted Cross Account Roles", "severity": "Medium", "description": "Ensures that only trusted cross-account IAM roles can be used.", "more_info": "IAM roles should be configured to allow access to trusted account IDs.", "service": "iam"}, {"checkname": "usersMfaEnabled", "title": "Users MFA Enabled", "severity": "High", "description": "Ensures a multi-factor authentication device is enabled for all users within the account", "more_info": "User accounts should have an MFA device setup to enable two-factor authentication", "service": "iam"}, {"checkname": "usersPasswordAndKeys", "title": "Users Password And Keys", "severity": "High", "description": "Detects whether users with a console password are also using access keys", "more_info": "Access keys should only be assigned to machine users and should not be used for accounts that have console password access.", "service": "iam"}, {"checkname": "usersPasswordLastUsed", "title": "Users Password Last Used", "severity": "Medium", "description": "Return a failing result when users with password logins exceed this number of days without being used", "more_info": "", "service": "iam"}, {"checkname": "dockerfileTemplateEncrypted", "title": "Dockerfile Template Encrypted", "severity": "Low", "description": "Ensure that Image Recipe dockerfile templates are encrypted.", "more_info": "Image Builder now offers a managed service for building Docker images. With Image Builder, you can automatically produce new up-to-date container images and publish them to specified Amazon Elastic Container Registry (Amazon ECR) repositories after running stipulated tests. Custom components are encrypted with your KMS key or a KMS key owned by Image Builder.", "service": "imagebuilder"}, {"checkname": "enhancedMetadataEnabled", "title": "Enhanced Metadata Collection Enabled", "severity": "Low", "description": "Ensure that enhanced metadata collection is enabled for image pipelines.", "more_info": "EC2 Image Builder is a fully managed AWS service that makes it easier to automate the creation, management, and deployment of customized, secure, and up-to-date server images that are pre-installed and pre-configured with software and settings to meet specific IT standards.", "service": "imagebuilder"}, {"checkname": "imageRecipeVolumeEncrypted", "title": "Image Recipe Storage Volumes Encrypted", "severity": "High", "description": "Ensure that Image Recipe storage ebs volumes are encrypted.", "more_info": "EC2 Image Builder is a fully managed AWS service that makes it easier to automate the creation, management, and deployment of customized, secure, and up-to-date server images that are pre-installed and pre-configured with software and settings to meet specific IT standards.", "service": "imagebuilder"}, {"checkname": "imgBuilderComponentsEncrypted", "title": "Image Builder Components Encrypted", "severity": "Medium", "description": "Ensure that Image Builder components are encrypted.", "more_info": "Build components contain software, settings, and configurations that are installed or applied during the process of building custom images. Tests are run after a custom image is built to validate functionality, security, performance, etc. Custom components are encrypted with your KMS key or a KMS key owned by Image Builder.", "service": "imagebuilder"}, {"checkname": "infraConfigNotificationEnabled", "title": "Infrastructure Configuration Notification Enabled", "severity": "Low", "description": "Ensure that Image Builder infrastructure configurations have SNS notifications enabled.", "more_info": "Infrastructure configurations allow you to specify the infrastructure within which to build and test your EC2 Image Builder image.", "service": "imagebuilder"}, {"checkname": "iotsitewiseDataEncrypted", "title": "IoT SiteWise Data Encrypted", "severity": "High", "description": "Ensure that AWS IoT SiteWise is using desired encryption level for data at-rest.", "more_info": "", "service": "iotsitewise"}, {"checkname": "kendraIndexEncrypted", "title": "Kendra Index Encrypted", "severity": "High", "description": "Ensure that the Kendra index is encrypted using desired encryption level.", "more_info": "Amazon Kendra encrypts your data at rest with AWS-manager keys by default. Use customer-managed keys instead in order to gain more granular control over encryption/decryption process.", "service": "kendra"}, {"checkname": "kinesisDataStreamsEncrypted", "title": "Kinesis Data Streams Encrypted", "severity": "High", "description": "Ensures Kinesis data streams are encrypted using AWS KMS key of desired encryption level.", "more_info": "", "service": "kinesis"}, {"checkname": "kinesisEncrypted", "title": "Kinesis Streams Encrypted", "severity": "High", "description": "Ensures Kinesis Streams encryption is enabled", "more_info": "Data sent to Kinesis Streams can be encrypted using KMS server-side encryption. Existing streams can be modified to add encryption with minimal overhead.", "service": "kinesis"}, {"checkname": "videostreamDataEncrypted", "title": "Video Stream Data Encrypted", "severity": "High", "description": "Ensure that Amazon Kinesis Video Streams is using desired encryption level for Data at-rest.", "more_info": "", "service": "kinesisvideo"}, {"checkname": "kmsAppTierCmk", "title": "App-Tier KMS Customer Master Key (CMK)", "severity": "Medium", "description": "Ensures that there is one Amazon KMS Customer Master Key (CMK) present in the account for App-Tier resources.", "more_info": "Amazon KMS should have Customer Master Key (CMK) for App-Tier to protect data in transit.", "service": "kms"}, {"checkname": "kmsDefaultKeyUsage", "title": "KMS Default Key Usage", "severity": "Medium", "description": "Checks AWS services to ensure the default KMS key is not being used", "more_info": "It is recommended not to use the default key to avoid encrypting disparate sets of data with the same key. Each application should have its own customer-managed KMS key", "service": "kms"}, {"checkname": "kmsDuplicateGrants", "title": "KMS Duplicate Grants", "severity": "Medium", "description": "Ensure that AWS KMS keys does not have duplicate grants to adhere to AWS security best practices.", "more_info": "", "service": "kms"}, {"checkname": "kmsGrantLeastPrivilege", "title": "KMS Grant Least Privilege", "severity": "Medium", "description": "Ensure that AWS KMS key grants use the principle of least privileged access.", "more_info": "AWS KMS key grants should be created with minimum set of permissions required by grantee principal to adhere to AWS security best practices.", "service": "kms"}, {"checkname": "kmsKeyPolicy", "title": "KMS Key Policy", "severity": "High", "description": "Validates the KMS key policy to ensure least-privilege access.", "more_info": "KMS key policies should be designed to limit the number of users who can perform encrypt and decrypt operations. Each application should use its own key to avoid over exposure.", "service": "kms"}, {"checkname": "kmsKeyRotation", "title": "KMS Key Rotation", "severity": "Medium", "description": "Ensures KMS keys are set to rotate on a regular schedule", "more_info": "All KMS keys should have key rotation enabled. AWS will handle the rotation of the encryption key itself, as well as storage of previous keys, so previous data does not need to be re-encrypted before the rotation occurs.", "service": "kms"}, {"checkname": "kmsScheduledDeletion", "title": "KMS Scheduled Deletion", "severity": "Critical", "description": "Detects KMS keys that are scheduled for deletion", "more_info": "Deleting a KMS key will permanently prevent all data encrypted using that key from being decrypted. Avoid deleting keys unless no encrypted data is in use.", "service": "kms"}, {"checkname": "envVarsClientSideEncryption", "title": "Lambda Environment Variables Client Side Encryption", "severity": "High", "description": "Ensure that all sensitive AWS Lambda environment variable values are client side encrypted.", "more_info": "", "service": "lambda"}, {"checkname": "lambdaAdminPrivileges", "title": "Lambda Admin Privileges", "severity": "Medium", "description": "Ensures no Lambda function available in your AWS account has admin privileges.", "more_info": "AWS Lambda Function should have most-restrictive IAM permissions for Lambda security best practices.", "service": "lambda"}, {"checkname": "lambdaCodeSigningEnabled", "title": "Lambda Code Signing Enabled", "severity": "Medium", "description": "Ensure that AWS Lambda functions are configured to use the code signing feature.", "more_info": "Code signing for AWS Lambda helps to ensure that only trusted code runs in Lambda functions. Enabling code signing feature ensures that lambda checks every code deployment and verifies that the code package is signed by a trusted source.", "service": "lambda"}, {"checkname": "lambdaDeadLetterQueue", "title": "Lambda Dead Letter Queue", "severity": "Low", "description": "Ensure that AWS Lambda functions are configured to use a Dead Letter Queue.", "more_info": "", "service": "lambda"}, {"checkname": "lambdaEnhancedMonitoring", "title": "Lambda Enhanced Monitoring Enabled", "severity": "Medium", "description": "Ensure that AWS Lambda functions have enhanced monitoring enabled.", "more_info": "Enabling enhanced monitoring on lambda functions adds lambda insights extension as a layer to your functions, which helps to collect, aggregate, and summarizes system-level metrics including CPU, memory, disk, and network usage. It helps you to monitor, troubleshoot, and optimize your functions.", "service": "lambda"}, {"checkname": "lambdaHasTags", "title": "Lambda Has Tags", "severity": "Low", "description": "Ensure that AWS Lambda functions have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "lambda"}, {"checkname": "lambdaLogGroups", "title": "Lambda Log Groups", "severity": "Medium", "description": "Ensures each Lambda function has a valid log group attached to it", "more_info": "Every Lambda function created should automatically have a CloudWatch log group generated to handle its log streams.", "service": "lambda"}, {"checkname": "lambdaOldRuntimes", "title": "Lambda Old Runtimes", "severity": "Medium", "description": "Ensures Lambda functions are not using out-of-date runtime environments.", "more_info": "Lambda runtimes should be kept current with recent versions of the underlying codebase. Deprecated runtimes should not be used.", "service": "lambda"}, {"checkname": "lambdaPublicAccess", "title": "Lambda Public Access", "severity": "High", "description": "Ensures Lambda functions are not accessible globally", "more_info": "The Lambda function execution policy should not allow public invocation of the function.", "service": "lambda"}, {"checkname": "lambdaTracingEnabled", "title": "Lambda Tracing Enabled", "severity": "Medium", "description": "Ensures AWS Lambda functions have active tracing for X-Ray.", "more_info": "AWS Lambda functions should have active tracing in order to gain visibility into the functions execution and performance.", "service": "lambda"}, {"checkname": "lambdaUniqueExecutionRole", "title": "Lambda Unique Execution Role", "severity": "Medium", "description": "Ensure that AWS Lambda functions do not share the same execution role.", "more_info": "An execution role grants required permission to Lambda function to access AWS services and resources. It is recommended to associate the unique IAM role for each Lambda function to follow the principle of least privilege access.", "service": "lambda"}, {"checkname": "lambdaVpcConfig", "title": "Lambda VPC Config", "severity": "Medium", "description": "Ensures Lambda functions are created in a VPC.", "more_info": "Lambda functions should be created in an AWS VPC to avoid exposure to the Internet and to enable communication with VPC resources through NACLs and security groups.", "service": "lambda"}, {"checkname": "lexAudioLogsEncrypted", "title": "Audio Logs Encrypted", "severity": "High", "description": "Ensure that Amazon Lex audio logs are encrypted using desired KMS encryption level", "more_info": "For audio logs you use default encryption on your S3 bucket or specify an AWS KMS key to encrypt your audio objects. Even if your S3 bucket uses default encryption you can still specify a different AWS KMS key to encrypt your audio objects for enhanced security.", "service": "lex"}, {"checkname": "geoCollectionDataEncrypted", "title": "Geofence Collection Data Encrypted", "severity": "High", "description": "Ensure that Amazon Location geoference collection data is encrypted using desired KMS encryption level.", "more_info": "", "service": "location"}, {"checkname": "trackerDataEncrypted", "title": "Tracker Data Encrypted", "severity": "High", "description": "Ensure that Amazon Location tracker data is encrypted using desired KMS encryption level", "more_info": "", "service": "location"}, {"checkname": "anomalyDetectorEncrypted", "title": "LookoutMetrics Anomaly Detector Encrypted", "severity": "High", "description": "Ensure that Amazon LookoutMetrics Anomaly Detector is encrypted using desired KMS encryption level", "more_info": "", "service": "lookout"}, {"checkname": "equipmentdatasetEncrypted", "title": "LookoutEquipment Dataset Encrypted", "severity": "High", "description": "Ensure that Amazon Lookout for Equipment datasets are encrypted using desired KMS encryption level", "more_info": "", "service": "lookout"}, {"checkname": "modelDataEncrypted", "title": "Model Data Encrypted", "severity": "High", "description": "Ensure that Lookout for Vision model data is encrypted using desired KMS encryption level", "more_info": "", "service": "lookout"}, {"checkname": "networkMemberDataEncrypted", "title": "Managed Blockchain Network Member Data Encrypted", "severity": "High", "description": "Ensure that members created in Amazon Managed Blockchain are encrypted using desired encryption level.", "more_info": "", "service": "managedblockchain"}, {"checkname": "memorydbClusterEncrypted", "title": "MemoryDB Cluster Encrypted", "severity": "High", "description": "Ensure that your Amazon MemoryDB cluster is encrypted with desired encryption level.", "more_info": "", "service": "memorydb"}, {"checkname": "mqAutoMinorVersionUpgrade", "title": "MQ Auto Minor Version Upgrade", "severity": "Medium", "description": "Ensure that Amazon MQ brokers have the Auto Minor Version Upgrade feature enabled.", "more_info": "As AWS MQ deprecates minor engine version periodically and provides new versions for upgrade, it is highly recommended that Auto Minor Version Upgrade feature is enabled to apply latest upgrades.", "service": "mq"}, {"checkname": "mqBrokerEncrypted", "title": "MQ Broker Encrypted", "severity": "High", "description": "Ensure that Amazon MQ brokers have data encrypted at-rest feature enabled.", "more_info": "Amazon MQ encryption at rest provides enhanced security by encrypting your data using encryption keys stored in the AWS Key Management Service (KMS).", "service": "mq"}, {"checkname": "mqBrokerPublicAccess", "title": "MQ Broker Public Accessibility", "severity": "Medium", "description": "Ensure that Amazon MQ brokers are not publicly accessible.", "more_info": "Public Amazon MQ brokers can be accessed directly, outside of a Virtual Private Cloud (VPC), therefore every machine on the internet can reach your brokers through their public endpoints and this can increase the opportunity for malicious activity.", "service": "mq"}, {"checkname": "mqDeploymentMode", "title": "MQ Deployment Mode", "severity": "Low", "description": "Ensure that for high availability, your AWS MQ brokers are using the active/standby deployment mode instead of single-instance ", "more_info": "With the active/standby deployment mode as opposed to the single-broker mode (enabled by default), you can achieve high availability for your Amazon MQ brokers as the service provides failure proof no risk.", "service": "mq"}, {"checkname": "mqDesiredInstanceType", "title": "MQ Desired Broker Instance Type", "severity": "Medium", "description": "Ensure that the Amazon MQ broker instances are created with desired instance types.", "more_info": "", "service": "mq"}, {"checkname": "mqLatestEngineVersion", "title": "MQ Latest Engine Version", "severity": "Low", "description": "Ensure that Amazon MQ brokers are using the latest version of Apache ActiveMQ broker engine.", "more_info": "Using the latest version of Apache ActiveMQ engine helps follow AWS best practices and benefits from the latest features, performance improvements, and security updates.", "service": "mq"}, {"checkname": "mqLogExports", "title": "MQ Log Exports Enabled", "severity": "Medium", "description": "Ensure that Amazon MQ brokers have the Log Exports feature enabled.", "more_info": "Amazon MQ has a feature of AWS CloudWatch Logs, a service of storing, accessing and monitoring your log files from different sources within your AWS account.", "service": "mq"}, {"checkname": "mskClusterCBEncryption", "title": "MSK Cluster Client Broker Encryption", "severity": "Low", "description": "Ensure that only TLS encryption between the client and broker feature is enabled for your Amazon MSK clusters.", "more_info": "Amazon MSK in-transit encryption is an optional feature which encrypts data in transit between the client and brokers. Select the Transport Layer Security (TLS) protocol to encrypt data as it travels between brokers and clients within the cluster.", "service": "msk"}, {"checkname": "mskClusterEncryptionAtRest", "title": "MSK Cluster Encryption At-Rest", "severity": "High", "description": "Ensure that Amazon Managed Streaming for Kafka (MSK) clusters are using desired encryption key for at-rest encryption.", "more_info": "Amazon MSK encrypts all data at rest using AWS-managed KMS keys by default. Use AWS customer-managed Keys (CMKs) instead in order to have a fine-grained control over data-at-rest encryption/decryption process and meet compliance requirements.", "service": "msk"}, {"checkname": "mskClusterEncryptionInTransit", "title": "MSK Cluster Encryption In-Transit", "severity": "Medium", "description": "Ensure that TLS encryption within the cluster feature is enabled for your Amazon MSK clusters.", "more_info": "Amazon MSK in-transit encryption is an optional feature which encrypts data in transit within your MSK cluster. You can override this default at the time you create the cluster.", "service": "msk"}, {"checkname": "mskClusterPublicAccess", "title": "MSK Cluster Public Access", "severity": "Medium", "description": "Ensure that public access feature within the cluster is disabled for your Amazon MSK clusters.", "more_info": "Amazon MSK gives you the option to turn on public access to the brokers of MSK clusters running Apache Kafka 2.6.0 or later versions. For security reasons, you cannot turn on public access while creating an MSK cluster. However, you can update an existing cluster to make it publicly accessible.", "service": "msk"}, {"checkname": "mskClusterUnauthAccess", "title": "MSK Cluster Unauthenticated Access", "severity": "Medium", "description": "Ensure that unauthenticated access feature is disabled for your Amazon MSK clusters.", "more_info": "Amazon MSK authenticates clients to allow or deny Apache Kafka actions. Alternatively, TLS or SASL/SCRAM can be used to authenticate clients, and Apache Kafka ACLs to allow or deny actions.", "service": "msk"}, {"checkname": "environmentAdminPrivileges", "title": "Environment Admin Privileges", "severity": "Medium", "description": "Ensures no Amazon MWAA environment available in your AWS account has admin privileges.", "more_info": "Amazon MWAA environments should have most-restrictive IAM permissions for security best practices.", "service": "mwaa"}, {"checkname": "environmentDataEncrypted", "title": "Environment Data Encrypted", "severity": "High", "description": "Ensure that AWS MWAA environment data is encrypted", "more_info": "", "service": "mwaa"}, {"checkname": "webServerPublicAccess", "title": "Web Server Public Access", "severity": "Medium", "description": "Ensures web access to the Apache Airflow UI in your MWAA environment is not public.", "more_info": "To restrict access to the Apache Airflow UI, environment should be configured to be accessible only from within the VPC selected.", "service": "mwaa"}, {"checkname": "neptuneDBInstanceEncrypted", "title": "Neptune Database Instance Encrypted", "severity": "High", "description": "Ensure that your AWS Neptune database instances are encrypted with KMS Customer Master Keys (CMKs) instead of AWS managed-keys.", "more_info": "", "service": "neptune"}, {"checkname": "opensearchCollectionCmkEncrypted", "title": "OpenSearch Collection CMK Encryption", "severity": "High", "description": "Ensures that OpenSearch Serverless collections are encrypted with KMS Customer Master Keys (CMKs).", "more_info": "OpenSearch Serverless should use KMS Customer Master Keys (CMKs) instead of AWS managed keys for encryption in order to have full control over data encryption and decryption.", "service": "openSearchServerless"}, {"checkname": "opensearchCollectionPublicAccess", "title": "OpenSearch Collection Public Access", "severity": "Medium", "description": "Ensures that OpenSearch Serverless collections are not publicly accessible.", "more_info": "OpenSearch Serverless collections should be not be publicly accessible to prevent unauthorized actions.", "service": "openSearchServerless"}, {"checkname": "opensearchAccessFromIps", "title": "OpenSearch Access From IP Addresses", "severity": "High", "description": "Ensure only whitelisted IP addresses can access Amazon OpenSearch domains.", "more_info": "OpenSearch domains should only be accessible only from whitelisted IP addresses to avoid unauthorized access.", "service": "opensearch"}, {"checkname": "opensearchClusterStatus", "title": "OpenSearch Cluster Status", "severity": "High", "description": "Ensure that OpenSearch clusters are healthy, i.e status is green.", "more_info": "Unhealthy Amazon OpenSearch clusters with the status set to \"Red\" is crucial for availability of OpenSearch applications.", "service": "opensearch"}, {"checkname": "opensearchCrossAccountAccess", "title": "OpenSearch Domain Cross Account access", "severity": "Critical", "description": "Ensures that only trusted accounts have access to OpenSearch domains.", "more_info": "Allowing unrestricted access of OpenSearch clusters will cause data leaks and data loss. This can be prevented by restricting access only to the trusted entities by implementing the appropriate access policies.", "service": "opensearch"}, {"checkname": "opensearchDedicatedMasterEnabled", "title": "OpenSearch Dedicated Master Enabled", "severity": "Medium", "description": "Ensure that Amazon OpenSearch domains are using dedicated master nodes.", "more_info": "Using OpenSearch dedicated master nodes to separate management tasks from index and search requests will improve the clusters ability to manage easily different types of workload and make them more resilient in production.", "service": "opensearch"}, {"checkname": "opensearchDesiredInstanceTypes", "title": "OpenSearch Desired Instance Type", "severity": "Medium", "description": "Ensure that all your Amazon OpenSearch cluster instances are of given instance types.", "more_info": "Limiting the type of Amazon OpenSearch cluster instances that can be provisioned will help address compliance requirements and prevent unexpected charges on the AWS bill.", "service": "opensearch"}, {"checkname": "opensearchDomainEncryptionEnabled", "title": "OpenSearch Encryption Enabled", "severity": "High", "description": "Ensure that AWS OpenSearch domains have encryption enabled.", "more_info": "OpenSearch domains should be encrypted to ensure that data is secured.", "service": "opensearch"}, {"checkname": "opensearchEnableAuditLogs", "title": "OpenSearch Audit Logs Enabled", "severity": "Medium", "description": "Ensures that audit logs feature is enabled for OpenSearch domains.", "more_info": "Enabling audit logs feature allows to keep track of all user activity on Amazon OpenSearch domains (clusters), including failed login attempts, including authentication success and failures, index changes, and incoming search queries, enhancing security and compliance monitoring.", "service": "opensearch"}, {"checkname": "opensearchEncryptedDomain", "title": "OpenSearch Encrypted Domain", "severity": "High", "description": "Ensures OpenSearch domains are encrypted with KMS", "more_info": "OpenSearch domains should be encrypted to ensure data at rest is secured.", "service": "opensearch"}, {"checkname": "opensearchExposedDomain", "title": "OpenSearch Exposed Domain", "severity": "High", "description": "Ensures OpenSearch domains are not publicly exposed to all AWS accounts", "more_info": "OpenSearch domains should not be publicly exposed to all AWS accounts.", "service": "opensearch"}, {"checkname": "opensearchHttpsOnly", "title": "OpenSearch HTTPS Only", "severity": "Medium", "description": "Ensures OpenSearch domains are configured to enforce HTTPS connections", "more_info": "OpenSearch domains should be configured to enforce HTTPS connections for all clients to ensure encryption of data in transit.", "service": "opensearch"}, {"checkname": "opensearchLoggingEnabled", "title": "OpenSearch Logging Enabled", "severity": "Medium", "description": "Ensures OpenSearch domains are configured to log data to CloudWatch", "more_info": "OpenSearch domains should be configured with logging enabled with logs sent to CloudWatch for analysis and long-term storage.", "service": "opensearch"}, {"checkname": "opensearchNodeToNodeEncryption", "title": "OpenSearch Node To Node Encryption", "severity": "High", "description": "Ensures OpenSearch domain traffic is encrypted in transit between nodes", "more_info": "OpenSearch domains should use node-to-node encryption to ensure data in transit remains encrypted using TLS 1.2.", "service": "opensearch"}, {"checkname": "opensearchPublicEndpoint", "title": "OpenSearch Public Service Domain", "severity": "Medium", "description": "Ensures OpenSearch domains are created with private VPC endpoint options", "more_info": "OpenSearch domains can either be created with a public endpoint or with a VPC configuration that enables internal VPC communication. Domains should be created without a public endpoint to prevent potential public access to the domain.", "service": "opensearch"}, {"checkname": "opensearchRequireIAMAuth", "title": "OpenSearch IAM Authentication", "severity": "Low", "description": "Ensures OpenSearch domains require IAM Authentication", "more_info": "OpenSearch domains can allow access without IAM authentication by having a policy that does not specify the principal or has a wildcard principal", "service": "opensearch"}, {"checkname": "opensearchTlsVersion", "title": "OpenSearch TLS Version", "severity": "Medium", "description": "Ensure OpenSearch domain is using the latest security policy to only allow TLS v1.2", "more_info": "OpenSearch domains should be configured to enforce TLS version 1.2 for all clients to ensure encryption of data in transit with updated features.", "service": "opensearch"}, {"checkname": "opensearchUpgradeAvailable", "title": "OpenSearch Upgrade Available", "severity": "Medium", "description": "Ensures OpenSearch domains are running the latest service software", "more_info": "OpenSearch domains should be configured to run the latest service software which often contains security updates.", "service": "opensearch"}, {"checkname": "opensearchVersion", "title": "OpenSearch Version", "severity": "Medium", "description": "Ensures OpenSearch domains are using the latest engine version.", "more_info": "OpenSearch domains should be upgraded to the latest version for optimal performance and security.", "service": "opensearch"}, {"checkname": "opensearchZoneAwarenessEnabled", "title": "OpenSearch Zone Awareness Enabled", "severity": "Medium", "description": "Ensure that OpenSearch domains have zone awareness enabled.", "more_info": "To improve the fault-tolerance for your OpenSearch domain, ensure you enable zone awareness. It distributes the OpenSearch nodes across multiple availability zones in the same AWS region and assures the cluster is highly available.", "service": "opensearch"}, {"checkname": "enableAllFeatures", "title": "Enable All Organization Features", "severity": "Medium", "description": "Ensures all Organization features are enabled", "more_info": "All AWS Organizations should be enabled to take advantage of all shared security controls and policies across all member accounts.", "service": "organizations"}, {"checkname": "organizationInvite", "title": "Organization Invite", "severity": "Medium", "description": "Ensure all Organization invites are accepted", "more_info": "AWS Organizations invites should be accepted or rejected quickly so that member accounts can take advantage of all Organization features.", "service": "organizations"}, {"checkname": "environmentTemplateEncrypted", "title": "Environment Template Encrypted", "severity": "High", "description": "Ensure that AWS Proton environment template is encrypted with desired level.", "more_info": "AWS Proton encrypts sensitive data in your template bundles at rest in the S3 bucket where you store your template bundles using AWS-managed keys. Use customer-managed keys (CMKs) in order to meet regulatory compliance requirements within your organization.", "service": "proton"}, {"checkname": "ledgerEncrypted", "title": "Ledger Encrypted", "severity": "High", "description": "Ensure that AWS QLDB ledger is encrypted using desired encryption level", "more_info": "", "service": "qldb"}, {"checkname": "iamDbAuthenticationEnabled", "title": "RDS IAM Database Authentication Enabled", "severity": "Medium", "description": "Ensures IAM Database Authentication is enabled for RDS database instances to manage database access", "more_info": "AWS Identity and Access Management (IAM) can be used to authenticate to your RDS DB instances.", "service": "rds"}, {"checkname": "idleRDSInstance", "title": "RDS Idle Instance Status", "severity": "High", "description": "Ensure there are no RDS instances with CPU utilization below all of the defined thresholds within last 7 days.", "more_info": "Idle Amazon RDS instance is a prime candidate for reducing monthly AWS expenses and preventing unnecessary usage charges from accumulating.", "service": "rds"}, {"checkname": "mysqlVulnerabilityCheck", "title": "RDS MySQL Vulnerability Check", "severity": "Medium", "description": " Ensures RDS MySQL instances are not vulnerable to specific CVEs.", "more_info": "Vulnerabilities in RDS MySQL instances can pose significant risks to the security and integrity of your database environment. By identifying and addressing these vulnerabilities, you can protect your data from unauthorized access, data tampering, or privilege escalation.", "service": "rds"}, {"checkname": "overutilizedRDSInstance", "title": "RDS CPU Alarm Threshold Exceeded", "severity": "High", "description": "Ensure RDS instances do not exceed the alarm threshold for CPU utilization.", "more_info": "High CPU usage may suggest that the databases on these servers lack sufficient hardware resources to operate at their best. Enhancing the performance of overburdened RDS instances by upgrading them can directly enhance the well-being and performance of the databases.", "service": "rds"}, {"checkname": "rdsAutomatedBackups", "title": "RDS Automated Backups", "severity": "High", "description": "Ensures automated backups are enabled for RDS instances", "more_info": "AWS provides a simple method of backing up RDS instances at a regular interval. This should be enabled to provide an option for restoring data in the event of a database compromise or hardware failure.", "service": "rds"}, {"checkname": "rdsCmkEncryptionEnabled", "title": "RDS CMK Encryption", "severity": "High", "description": "Ensures RDS instances are encrypted with KMS Customer Master Keys(CMKs).", "more_info": "RDS instances should be encrypted with Customer Master Keys in order to have full control over data encryption and decryption.", "service": "rds"}, {"checkname": "rdsDefaultPort", "title": "RDS Default Port", "severity": "Low", "description": "Ensure RDS database instances are not using the default ports.", "more_info": "Using default ports for running RDS instances can be a security risk. To protect publicly accessible RDS databases from brute force and dictionary attacks and add an additional layer of security, shift RDS instance ports to non-default ones.", "service": "rds"}, {"checkname": "rdsDefaultUsername", "title": "RDS Instance Default Master Username", "severity": "Medium", "description": "Ensures RDS instance does not have a default master username", "more_info": "By default, RDS uses the default master username which has the maximum permissions for your instance. RDS instances should be configured to use unique username to ensure security.", "service": "rds"}, {"checkname": "rdsDeletionProtectionEnabled", "title": "RDS Deletion Protection Enabled", "severity": "Medium", "description": "Ensures deletion protection is enabled for RDS database instances.", "more_info": "Deletion protection prevents Amazon RDS instances from being deleted accidentally by any user.", "service": "rds"}, {"checkname": "rdsEncryptionEnabled", "title": "RDS Encryption Enabled", "severity": "High", "description": "Ensures at-rest encryption is setup for RDS instances", "more_info": "AWS provides at-read encryption for RDS instances which should be enabled to ensure the integrity of data stored within the databases.", "service": "rds"}, {"checkname": "rdsInstanceGeneration", "title": "RDS Instance Generation", "severity": "Medium", "description": "Ensures that AWS RDS instance is not using older generation of EC2", "more_info": "Amazon RDS instances running on older generation EC2 instances may not have access to the latest hardware capabilities and performance improvements. It is recommended to upgrade the RDS instance to its latest generation for optimal performance and security.", "service": "rds"}, {"checkname": "rdsInstanceHasTags", "title": "RDS Instance Has Tags", "severity": "Low", "description": "Ensure that AWS RDS instance have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "rds"}, {"checkname": "rdsLoggingEnabled", "title": "RDS Logging Enabled", "severity": "Low", "description": "Ensures logging is configured for RDS instances", "more_info": "Logging database level events enables teams to analyze events for the purpose diagnostics as well as audit tracking for compliance purposes.", "service": "rds"}, {"checkname": "rdsMinorVersionUpgrade", "title": "RDS DocumentDB Minor Version Upgrade", "severity": "Medium", "description": "Ensures Auto Minor Version Upgrade is enabled on RDS and DocumentDB databases", "more_info": "RDS supports automatically upgrading the minor version of the database, which should be enabled to ensure security fixes are quickly deployed.", "service": "rds"}, {"checkname": "rdsMultiAz", "title": "RDS Multiple AZ", "severity": "Medium", "description": "Ensures that RDS instances are created to be cross-AZ for high availability.", "more_info": "Creating RDS instances in a single AZ creates a single point of failure for all systems relying on that database. All RDS instances should be created in multiple AZs to ensure proper failover.", "service": "rds"}, {"checkname": "rdsPublicSubnet", "title": "RDS Public Subnet", "severity": "High", "description": "Ensures RDS database instances are not deployed in public subnet.", "more_info": "RDS instances should not be deployed in public subnets to prevent direct exposure to the internet and reduce the risk of unauthorized access.", "service": "rds"}, {"checkname": "rdsPubliclyAccessible", "title": "RDS Publicly Accessible", "severity": "Critical", "description": "Ensures RDS instances are not launched into the public cloud", "more_info": "Unless there is a specific business requirement, RDS instances should not have a public endpoint and should be accessed from within a VPC only.", "service": "rds"}, {"checkname": "rdsRestorable", "title": "RDS Restorable", "severity": "Medium", "description": "Ensures RDS instances can be restored to a recent point", "more_info": "AWS will maintain a point to which the database can be restored. This point should not drift too far into the past, or else the risk of irrecoverable data loss may occur.", "service": "rds"}, {"checkname": "rdsSnapshotEncryption", "title": "RDS Snapshot Encryption", "severity": "High", "description": "Ensures encryption is enabled for RDS snapshots to ensure encryption of data at rest.", "more_info": "AWS provides encryption for RDS snapshots which should be enabled to ensure that all data at rest is encrypted.", "service": "rds"}, {"checkname": "rdsSnapshotPubliclyAccessible", "title": "RDS Snapshot Publicly Accessible", "severity": "High", "description": "Ensure that Amazon RDS database snapshots are not publicly exposed.", "more_info": "", "service": "rds"}, {"checkname": "rdsTransportEncryption", "title": "RDS Transport Encryption Enabled", "severity": "High", "description": "Ensures RDS SQL Server instances have Transport Encryption enabled.", "more_info": "Parameter group associated with the RDS instance should have transport encryption enabled to handle encryption and decryption", "service": "rds"}, {"checkname": "sqlServerTLSVersion", "title": "SQL Server TLS Version", "severity": "Medium", "description": "Ensures RDS SQL Servers do not allow outdated TLS certificate versions", "more_info": "TLS 1.2 or higher should be used for all TLS connections to RDS. A parameter group can be used to enforce this connection type.", "service": "rds"}, {"checkname": "auditLoggingEnabled", "title": "Redshift Cluster Audit Logging Enabled", "severity": "Medium", "description": "Ensure audit logging is enabled for Redshift clusters for security and troubleshooting purposes.", "more_info": "Redshift clusters should be configured to enable audit logging to log cluster usage information.", "service": "redshift"}, {"checkname": "redshiftAllowVersionUpgrade", "title": "Redshift Cluster Allow Version Upgrade", "severity": "Medium", "description": "Ensure that version upgrade is enabled for Redshift clusters to automatically receive upgrades during the maintenance window.", "more_info": "Redshift clusters should be configured to allow version upgrades to get the newest features, bug fixes or the latest security patches released.", "service": "redshift"}, {"checkname": "redshiftClusterCmkEncrypted", "title": "Redshift Cluster CMK Encryption", "severity": "High", "description": "Ensures Redshift clusters are encrypted using KMS customer master keys (CMKs)", "more_info": "KMS CMKs should be used to encrypt redshift clusters in order to have full control over data encryption and decryption.", "service": "redshift"}, {"checkname": "redshiftClusterDefaultPort", "title": "Redshift Cluster Default Port", "severity": "Low", "description": "Ensures that Amazon Redshift clusters are not using port \"5439\" (default port) for database access.", "more_info": "Amazon Redshift clusters should not use the default port for database access to ensure cluster security.", "service": "redshift"}, {"checkname": "redshiftClusterInVpc", "title": "Redshift Cluster In VPC", "severity": "Medium", "description": "Ensures that Amazon Redshift clusters are launched within a Virtual Private Cloud (VPC).", "more_info": "Amazon Redshift clusters should be launched within a Virtual Private Cloud (VPC) to ensure cluster security.", "service": "redshift"}, {"checkname": "redshiftClusterMasterUsername", "title": "Redshift Cluster Default Master Username", "severity": "Low", "description": "Ensures that Amazon Redshift clusters are not using \"awsuser\" (default master username) for database access.", "more_info": "Amazon Redshift clusters should not use default master username for database access to ensure cluster security.", "service": "redshift"}, {"checkname": "redshiftDesiredNodeType", "title": "Redshift Desired Node Type", "severity": "Medium", "description": "Ensures that Amazon Redshift cluster nodes are of given types.", "more_info": "Amazon Redshift clusters nodes should be of the given types to ensure the internal compliance and prevent unexpected billing charges.", "service": "redshift"}, {"checkname": "redshiftEncryptionEnabled", "title": "Redshift Encryption Enabled", "severity": "High", "description": "Ensures at-rest encryption is setup for Redshift clusters", "more_info": "AWS provides at-read encryption for Redshift clusters which should be enabled to ensure the integrity of data stored within the cluster.", "service": "redshift"}, {"checkname": "redshiftNodesCount", "title": "Redshift Nodes Count", "severity": "Medium", "description": "Ensures that each AWS region has not reached the limit set for the number of Redshift cluster nodes.", "more_info": "The number of provisioned Amazon Redshift cluster nodes must be less than the provided nodes limit to avoid reaching the limit and exceeding the set budget.", "service": "redshift"}, {"checkname": "redshiftPubliclyAccessible", "title": "Redshift Publicly Accessible", "severity": "High", "description": "Ensures Redshift clusters are not launched into the public cloud", "more_info": "Unless there is a specific business requirement, Redshift clusters should not have a public endpoint and should be accessed from within a VPC only.", "service": "redshift"}, {"checkname": "redshiftSSLEnabled", "title": "Redshift Parameter Group SSL Required", "severity": "Medium", "description": "Ensures AWS Redshift non-default parameter group associated with Redshift cluster require SSL connection.", "more_info": "Redshift parameter group associated with Redshift cluster should be configured to require SSL to secure data in transit.", "service": "redshift"}, {"checkname": "redshiftUnusedReservedNodes", "title": "Redshift Unused Reserved Nodes", "severity": "High", "description": "Ensures that Amazon Redshift Reserved Nodes are being utilized.", "more_info": "Amazon Redshift reserved nodes must be utilized to avoid unnecessary billing.", "service": "redshift"}, {"checkname": "snapshotRetentionPeriod", "title": "Redshift Automated Snapshot Retention Period", "severity": "Low", "description": "Ensures that retention period is set for Amazon Redshift automated snapshots.", "more_info": "Amazon Redshift clusters should have retention period set for automated snapshots for data protection and to avoid unexpected failures.", "service": "redshift"}, {"checkname": "underutilizedRedshiftCluster", "title": "Underutilized Redshift Cluster Check", "severity": "High", "description": "Ensure Redshift clusters are not underutilized", "more_info": "Underutilized clusters are good candidates to reduce your monthly AWS costs and avoid accumulating unnecessary usage charges.", "service": "redshift"}, {"checkname": "userActivityLoggingEnabled", "title": "Redshift User Activity Logging Enabled", "severity": "Low", "description": "Ensure that user activity logging is enabled for your Amazon Redshift clusters.", "more_info": "Redshift clusters associated parameter groups should have user activity logging enabled in order to log user activities performed.", "service": "redshift"}, {"checkname": "danglingDnsRecords", "title": "Route53 Dangling DNS Records", "severity": "High", "description": "Ensures that AWS Route53 DNS records are not pointing to invalid/deleted EIPs.", "more_info": "AWS Route53 DNS records should not point to invalid/deleted EIPs to prevent malicious activities.", "service": "route53"}, {"checkname": "domainAutoRenew", "title": "Domain Auto Renew", "severity": "High", "description": "Ensures domains are set to auto renew through Route53", "more_info": "Domains purchased through Route53 should be set to auto renew. Domains that are not renewed can quickly be acquired by a third-party and cause loss of access for customers.", "service": "route53"}, {"checkname": "domainExpiry", "title": "Domain Expiry", "severity": "High", "description": "Ensures domains are not expiring too soon", "more_info": "Expired domains can be lost and reregistered by a third-party.", "service": "route53"}, {"checkname": "domainTransferLock", "title": "Domain Transfer Lock", "severity": "Medium", "description": "Ensures domains have the transfer lock set", "more_info": "To avoid having a domain maliciously transferred to a third-party, all domains should enable the transfer lock unless actively being transferred.", "service": "route53"}, {"checkname": "privacyProtection", "title": "Domain Privacy Protection", "severity": "Low", "description": "Ensure that Privacy Protection feature is enabled for your Amazon Route 53 domains.", "more_info": "Enabling the Privacy Protection feature protects against receiving spams and sharing contact information in response of WHOIS queries.", "service": "route53"}, {"checkname": "route53InUse", "title": "Route 53 In Use", "severity": "Low", "description": "Ensure that AWS Route 53 Domain Name System (DNS) service is used within your AWS account.", "more_info": "AWS Route 53 simplifies DNS management, ensuring reliable and efficient routing for end users to your website through globally-dispersed DNS servers, enhancing accessibility and performance. It facilitates domain registration, DNS routing, and health checking, allowing seamless management of your web infrastructure.", "service": "route53"}, {"checkname": "senderPolicyFwInUse", "title": "Sender Policy Framework In Use", "severity": "Medium", "description": "Ensure that Sender Policy Framework (SPF) is used to stop spammers from spoofing your AWS Route 53 domain.", "more_info": "The Sender Policy Framework enables AWS Route 53 registered domain to publicly state the mail servers that are authorized to send emails on its behalf.", "service": "route53"}, {"checkname": "senderPolicyFwRecordPresent", "title": "Sender Privacy Framework Record Present", "severity": "Medium", "description": "Ensure that Route 53 hosted zones have a DNS record containing Sender Policy Framework (SPF) value set for each MX record available.", "more_info": "The SPF record enables Route 53 registered domains to publicly state the mail servers that are authorized to send emails on its behalf.", "service": "route53"}, {"checkname": "bucketAllUsersAcl", "title": "S3 Bucket All Users ACL", "severity": "Medium", "description": "Ensures S3 buckets do not allow global write, delete, or read ACL permissions", "more_info": "S3 buckets can be configured to allow anyone, regardless of whether they are an AWS user or not, to write objects to a bucket or delete objects. This option should not be configured unless there is a strong business requirement.", "service": "s3"}, {"checkname": "bucketAllUsersPolicy", "title": "S3 Bucket All Users Policy", "severity": "Critical", "description": "Ensures S3 bucket policies do not allow global write, delete, or read permissions", "more_info": "S3 buckets can be configured to allow the global principal to access the bucket via the bucket policy. This policy should be restricted only to known users or accounts.", "service": "s3"}, {"checkname": "bucketDnsCompliantName", "title": "S3 DNS Compliant Bucket Names", "severity": "Low", "description": "Ensures that S3 buckets have DNS complaint bucket names.", "more_info": "S3 bucket names must be DNS-compliant and not contain period \".\" to enable S3 Transfer Acceleration and to use buckets over SSL.", "service": "s3"}, {"checkname": "bucketEncryption", "title": "S3 Bucket Encryption", "severity": "High", "description": "Ensures object encryption is enabled on S3 buckets", "more_info": "S3 object encryption provides fully-managed encryption of all objects uploaded to an S3 bucket.", "service": "s3"}, {"checkname": "bucketEncryptionInTransit", "title": "S3 Bucket Encryption In Transit", "severity": "High", "description": "Ensures S3 buckets have bucket policy statements that deny insecure transport", "more_info": "S3 bucket policies can be configured to deny access to the bucket over HTTP.", "service": "s3"}, {"checkname": "bucketEnforceEncryption", "title": "S3 Bucket Enforce Object Encryption", "severity": "High", "description": "Ensures S3 bucket policies do not allow uploads of unencrypted objects", "more_info": "S3 bucket policies can be configured to block uploads of objects that are not encrypted.", "service": "s3"}, {"checkname": "bucketLifecycleConfiguration", "title": "S3 Bucket Lifecycle Configuration", "severity": "Low", "description": "Ensures that S3 buckets have lifecycle configuration enabled to automatically transition S3 bucket objects.", "more_info": "S3 bucket should have lifecycle configuration enabled to automatically downgrade the storage class for your objects.", "service": "s3"}, {"checkname": "bucketLogging", "title": "S3 Bucket Logging", "severity": "Medium", "description": "Ensures S3 bucket logging is enabled for S3 buckets", "more_info": "S3 bucket logging helps maintain an audit trail of \\\n                access that can be used in the event of a security \\\n                incident.", "service": "s3"}, {"checkname": "bucketMFADeleteEnabled", "title": "S3 Bucket MFA Delete Status", "severity": "Low", "description": "Ensures MFA delete is enabled on S3 buckets.", "more_info": "", "service": "s3"}, {"checkname": "bucketPolicyCloudFrontOac", "title": "S3 Bucket Policy CloudFront OAC", "severity": "Medium", "description": "Ensures S3 bucket is origin to only one distribution and allows only that distribution.", "more_info": "Access to CloudFront origins should only happen via ClouFront URL and not from S3 URL or any source in order to restrict access to private data.", "service": "s3"}, {"checkname": "bucketPolicyCloudFrontOai", "title": "S3 Bucket Policy CloudFront OAI", "severity": "Medium", "description": "Ensures S3 bucket is origin to only one distribution and allows only that distribution.", "more_info": "Access to CloudFront origins should only happen via ClouFront URL and not from S3 URL or any source in order to restrict access to private data.", "service": "s3"}, {"checkname": "bucketPublicAccessBlock", "title": "S3 Bucket Public Access Block", "severity": "Medium", "description": "Ensures S3 public access block is enabled on all buckets or for AWS account", "more_info": "Blocking S3 public access at the account level or bucket-level ensures objects are not accidentally exposed.", "service": "s3"}, {"checkname": "bucketSecureTransportEnabled", "title": "S3 Secure Transport Enabled", "severity": "Medium", "description": "Ensure AWS S3 buckets enforce SSL to secure data in transit", "more_info": "", "service": "s3"}, {"checkname": "bucketTransferAcceleration", "title": "S3 Transfer Acceleration Enabled", "severity": "Medium", "description": "Ensures that S3 buckets have transfer acceleration enabled to increase the speed of data transfers.", "more_info": "S3 buckets should have transfer acceleration enabled to increase the speed of data transfers in and out of Amazon S3 using AWS edge network.", "service": "s3"}, {"checkname": "bucketVersioning", "title": "S3 Bucket Versioning", "severity": "Low", "description": "Ensures object versioning is enabled on S3 buckets", "more_info": "Object versioning can help protect against the overwriting of \\\n                objects or data loss in the event of a compromise.", "service": "s3"}, {"checkname": "bucketWebsiteEnabled", "title": "S3 Bucket Website Enabled", "severity": "High", "description": "Ensures S3 buckets are not configured with static website hosting", "more_info": "S3 buckets should not be configured with static website hosting with public objects. Instead, a CloudFront distribution should be configured with an origin access identity.", "service": "s3"}, {"checkname": "objectLevelReadEventLogging", "title": "S3 Object Read Logging", "severity": "Low", "description": "Ensure that Object-level logging for read events is enabled for S3 bucket.", "more_info": "Enabling Object-level S3 event logging significantly enhances security, especially for sensitive data.", "service": "s3"}, {"checkname": "objectLevelWriteEventLogging", "title": "S3 Object Write Logging", "severity": "Low", "description": "Ensure that Object-level logging for write events is enabled for S3 bucket.", "more_info": "Enabling Object-level S3 event logging significantly enhances security, especially for sensitive data.", "service": "s3"}, {"checkname": "s3BucketHasTags", "title": "S3 Bucket Has Tags", "severity": "Low", "description": "Ensure that AWS S3 Bucket have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "s3"}, {"checkname": "s3Encryption", "title": "S3 Bucket Encryption Enforcement", "severity": "High", "description": "All statements in all S3 bucket policies must have a condition that requires encryption at a certain level", "more_info": "S3 buckets support numerous types of encryption, including AES-256, KMS using a default key, KMS with a CMK, or via HSM-based key.", "service": "s3"}, {"checkname": "versionedBucketsLC", "title": "S3 Versioned Buckets Lifecycle Configuration", "severity": "Low", "description": "Ensure that S3 buckets having versioning enabled also have lifecycle policy configured for non-current objects.", "more_info": "", "service": "s3"}, {"checkname": "vaultPublicAccess", "title": "S3 Glacier Vault Public Access", "severity": "Medium", "description": "Ensure that S3 Glacier Vault public access block is enabled for the account.", "more_info": "Blocking S3 Glacier Vault public access at the account level ensures objects are not accidentally exposed.", "service": "s3glacier"}, {"checkname": "notebookDataEncrypted", "title": "Notebook Data Encrypted", "severity": "High", "description": "Ensure Notebook data is encrypted", "more_info": "An optional encryption key can be supplied during Notebook Instance creation.", "service": "sagemaker"}, {"checkname": "notebookDirectInternetAccess", "title": "Notebook Direct Internet Access", "severity": "Medium", "description": "Ensure Notebook Instance is not publicly available.", "more_info": "SageMaker notebooks should not be exposed to the Internet. Public availability can be configured via the DirectInternetAccess attribute.", "service": "sagemaker"}, {"checkname": "notebookInstanceInVpc", "title": "Notebook instance in VPC", "severity": "Medium", "description": "Ensure that Amazon SageMaker Notebook instances are launched within a VPC.", "more_info": "Launching instances can bring multiple advantages such as better networking infrastructure, much more flexible control over access security. Also it makes it possible to access VPC-only resources such as EFS file systems.", "service": "sagemaker"}, {"checkname": "secretHasTags", "title": "Secret Has Tags", "severity": "Low", "description": "Ensure that AWS Secrets Manager secrets have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "secretsmanager"}, {"checkname": "secretRotationEnabled", "title": "Secrets Manager Secret Rotation Enabled", "severity": "Medium", "description": "Ensures AWS Secrets Manager is configured to automatically rotate the secret for a secured service or database.", "more_info": "Secrets Manager rotation makes access to your databases and third-party services secure by automatically rotating secrets used to access these resources.", "service": "secretsmanager"}, {"checkname": "secretsManagerEncrypted", "title": "Secrets Manager Encrypted Secrets", "severity": "High", "description": "Ensures Secrets Manager Secrets are encrypted", "more_info": "Secrets Manager Secrets should be encrypted. This allows their values to be used by approved systems, while restricting access to other users of the account.", "service": "secretsmanager"}, {"checkname": "secretsManagerInUse", "title": "Secrets Manager In Use", "severity": "Medium", "description": "Ensure that Amazon Secrets Manager service is being used in your account to manage all the credentials.", "more_info": "Amazon Secrets Manager helps you protect sensitive information needed to access your cloud applications, services and resources. Users and apps can use secrets manager to get the secrets stored with a call to Secrets Manager API, enhancing access security.", "service": "secretsmanager"}, {"checkname": "securityHubEnabled", "title": "Security Hub Enabled", "severity": "Medium", "description": "Ensure that AWS Security Hub is enabled.", "more_info": "AWS Security Hub provides a comprehensive view of your security posture across your AWS accounts. It aggregates, organises, and prioritises security findings from various AWS services.", "service": "securityhub"}, {"checkname": "dkimEnabled", "title": "Email DKIM Enabled", "severity": "Low", "description": "Ensures DomainKeys Identified Mail (DKIM) is enabled for domains and addresses in SES.", "more_info": "DKIM is a security feature that allows recipients of an email to veriy that the sender domain has authorized the message and that it has not been spoofed.", "service": "ses"}, {"checkname": "emailMessagesEncrypted", "title": "SES Email Messages Encrypted", "severity": "High", "description": "Ensure that Amazon SES email messages are encrypted before delivering them to specified buckets.", "more_info": "Amazon SES email messages should be encrypted in case they are being delivered to S3 bucket to meet regulatory compliance requirements within your organization.", "service": "ses"}, {"checkname": "shieldAdvancedEnabled", "title": "Shield Advanced Enabled", "severity": "Medium", "description": "Ensures AWS Shield Advanced is setup and properly configured", "more_info": "AWS Shield Advanced provides enhanced DDOS protection for all enrolled services within a subscribed account. Subscriptions should be active.", "service": "shield"}, {"checkname": "shieldEmergencyContacts", "title": "Shield Emergency Contacts", "severity": "Medium", "description": "Ensures AWS Shield emergency contacts are configured", "more_info": "AWS Shield Emergency contacts should be configured so that AWS can contact an account representative in the event of a DDOS event.", "service": "shield"}, {"checkname": "shieldProtections", "title": "Shield Protections", "severity": "Medium", "description": "Ensures AWS Shield Advanced is configured to protect account resources", "more_info": "Once AWS Shield Advanced is enabled, it can be applied to resources within the account including ELBs, CloudFront.", "service": "shield"}, {"checkname": "snsCrossAccount", "title": "SNS Cross Account Access", "severity": "High", "description": "Ensures SNS policies disallow cross-account access", "more_info": "SNS topic policies should be carefully restricted to to subscribe or send messages. Topic policies can be used to limit these privileges.", "service": "sns"}, {"checkname": "snsSubscriptionHTTPSonly", "title": "SNS Subscription HTTPS Only", "severity": "Medium", "description": "Ensures that Amazon SNS subscriptions are configured to use HTTPS protocol", "more_info": "Amazon Simple Notification Service (Amazon SNS) is a managed service that provides message delivery from publishers to subscribers. It is important to verify that SNS subscriptions are configured to use the HTTPS protocol.", "service": "sns"}, {"checkname": "snsTopicHasTags", "title": "SNS Topic Has Tags", "severity": "Low", "description": "Ensure that Amazon SNS topics have tags associated.", "more_info": "Tags help you to group resources together that are related to or associated with each other. It is a best practice to tag cloud resources to better organize and gain visibility into their usage.", "service": "sns"}, {"checkname": "snsTopicNoHttpPolicy", "title": "SNS Topic HTTP Protocol Restriction", "severity": "Medium", "description": "Ensures SNS topics do not allow HTTP protocol.", "more_info": "SNS topics should be configured to restrict access to the HTTP protocol to prevent unauthorized send or subscribe operations.", "service": "sns"}, {"checkname": "snsValidSubscribers", "title": "SNS Valid Subscribers", "severity": "Medium", "description": "Ensure that Amazon SNS subscriptions are valid and there are no unwanted subscribers.", "more_info": "Amazon Simple Notification Service (Amazon SNS) is a managed service that provides message delivery from publishers to subscribers. So check for appropriate subscribers in order to improve access security to your SNS topics. ", "service": "sns"}, {"checkname": "topicCmkEncrypted", "title": "SNS Topic CMK Encryption", "severity": "High", "description": "Ensures Amazon SNS topics are encrypted with KMS Customer Master Keys (CMKs).", "more_info": "", "service": "sns"}, {"checkname": "topicEncrypted", "title": "SNS Topic Encrypted", "severity": "High", "description": "Ensures that Amazon SNS topics enforce Server-Side Encryption (SSE)", "more_info": "SNS topics should enforce Server-Side Encryption (SSE) to secure data at rest. SSE protects the contents of messages in Amazon SNS topics using keys managed in AWS Key Management Service (AWS KMS).", "service": "sns"}, {"checkname": "topicPolicies", "title": "SNS Topic Policies", "severity": "Medium", "description": "Ensures SNS topics do not allow global send or subscribe.", "more_info": "SNS policies should not be configured to allow any AWS user to subscribe or send messages. This could result in data leakage or financial DDoS.", "service": "sns"}, {"checkname": "queueUnprocessedMessages", "title": "SQS Queue Unprocessed Messages", "severity": "Medium", "description": "Ensures that Amazon SQS queue has not reached unprocessed messages limit.", "more_info": "Amazon SQS queues should have unprocessed messages less than the limit to be highly available and responsive.", "service": "sqs"}, {"checkname": "sqsCrossAccount", "title": "SQS Cross Account Access", "severity": "High", "description": "Ensures SQS policies disallow cross-account access", "more_info": "SQS policies should be carefully restricted to prevent publishing or reading from the queue from unexpected sources. Queue policies can be used to limit these privileges.", "service": "sqs"}, {"checkname": "sqsDeadLetterQueue", "title": "SQS Dead Letter Queue", "severity": "Low", "description": "Ensures that each Amazon SQS queue has Dead Letter Queue configured.", "more_info": "Amazon SQS queues should have dead letter queue configured to avoid data loss for unprocessed messages.", "service": "sqs"}, {"checkname": "sqsEncrypted", "title": "SQS Encrypted", "severity": "High", "description": "Ensures SQS encryption is enabled", "more_info": "Messages sent to SQS queues can be encrypted using KMS server-side encryption. Existing queues can be modified to add encryption with minimal overhead.", "service": "sqs"}, {"checkname": "sqsEncryptionEnabled", "title": "SQS Encryption Enabled", "severity": "High", "description": "Ensure SQS queues are encrypted using keys of desired encryption level", "more_info": "", "service": "sqs"}, {"checkname": "sqsPublicAccess", "title": "SQS Public Access", "severity": "Medium", "description": "Ensures that SQS queues are not publicly accessible", "more_info": "SQS queues should be not be publicly accessible to prevent unauthorized actions.", "service": "sqs"}, {"checkname": "ssmActiveOnAllInstances", "title": "SSM Agent Active All Instances", "severity": "Medium", "description": "Ensures SSM agents are installed and active on all servers", "more_info": "SSM allows for centralized monitoring of all servers and should be activated on all EC2 instances.", "service": "ssm"}, {"checkname": "ssmAgentAutoUpdateEnabled", "title": "SSM Agent Auto Update Enabled", "severity": "Medium", "description": "Ensures the SSM agent is configured to automatically update to new versions", "more_info": "To ensure the latest version of the SSM agent is installed, it should be configured to consume automatic updates.", "service": "ssm"}, {"checkname": "ssmAgentLatestVersion", "title": "SSM Agent Latest Version", "severity": "Medium", "description": "Ensures SSM agents installed on Linux hosts are running the latest version", "more_info": "SSM agent software provides sensitive access to servers and should be kept up-to-date.", "service": "ssm"}, {"checkname": "ssmDocumentPublicAccess", "title": "SSM Documents Public Access", "severity": "Medium", "description": "Ensure that SSM service has block public sharing setting enabled.", "more_info": "Public documents can be viewed by all AWS accounts. To prevent unwanted access to your documents, turn on the block public access sharing setting.", "service": "ssm"}, {"checkname": "ssmEncryptedParameters", "title": "SSM Encrypted Parameters", "severity": "High", "description": "Ensures SSM Parameters are encrypted", "more_info": "SSM Parameters should be encrypted. This allows their values to be used by approved systems, while restricting access to other users of the account.", "service": "ssm"}, {"checkname": "ssmManagedInstances", "title": "SSM Managed Instances", "severity": "High", "description": "Ensure that all Amazon EC2 instances are managed by AWS Systems Manager (SSM).", "more_info": "Systems Manager simplifies AWS cloud resource management, quickly detects and resolve operational problems, and makes it easier to operate and manage your instances securely at large scale.", "service": "ssm"}, {"checkname": "ssmSessionDuration", "title": "SSM Session Duration", "severity": "Low", "description": "Ensure that all active sessions in the AWS Session Manager do not exceed the duration set in the settings.", "more_info": "The session manager gives users the ability to either open a shell in a EC2 instance or execute commands in a ECS task. This can be useful for when debugging issues in a container or instance.", "service": "ssm"}, {"checkname": "timestreamDatabaseEncrypted", "title": "Timestream Database Encrypted", "severity": "High", "description": "Ensure that AWS Timestream databases are encrypted with KMS Customer Master Keys (CMKs) instead of AWS managed-keys.", "more_info": "", "service": "timestreamwrite"}, {"checkname": "transferLoggingEnabled", "title": "Transfer Logging Enabled", "severity": "Medium", "description": "Ensures AWS Transfer servers have CloudWatch logging enabled.", "more_info": "AWS Transfer servers can log activity to CloudWatch if a proper IAM service role is provided. This role should be configured for all servers to ensure proper access logging.", "service": "transfer"}, {"checkname": "transferPrivateLinkInUse", "title": "PrivateLink in Use for Transfer for SFTP Server Endpoints", "severity": "Medium", "description": "Ensure that AWS Transfer for SFTP server endpoints are configured to use VPC endpoints powered by AWS PrivateLink.", "more_info": "PrivateLink provides secure and private connectivity between VPCs and other AWS resources using a dedicated network.", "service": "transfer"}, {"checkname": "translateJobOutputEncrypted", "title": "Translate Job Output Encrypted", "severity": "High", "description": "Ensure that your Amazon Translate jobs have CMK encryption enabled for output data residing on S3.", "more_info": "", "service": "translate"}, {"checkname": "wafInUse", "title": "AWS WAF In Use", "severity": "Medium", "description": "Ensure that AWS Web Application Firewall (WAF) is in use to achieve availability and security for AWS-powered web applications.", "more_info": "Using WAF for your web application running in AWS environment can help against common web-based attacks, SQL injection attacks, DDOS attacks and more.", "service": "waf"}, {"checkname": "aclRulesDefaultAction", "title": "Web ACL Rules Default Action", "severity": "Medium", "description": "Ensure that default Web ACL action is set to \"Block\" for ACL rules with allow action.", "more_info": "Web ACL default action determines whether the incoming request is allowed or blocked when none of the rules are matched. As a security best practice, make sure it is set to ‘Block’ when you have configured web ACL rules with allow actions. This will limit the number of users accessing your web app and will reduce the scope of malicious attacks.", "service": "wafv2"}, {"checkname": "wafv2CloudwatchMetricsEnabled", "title": "AWS WAFV2 Cloudwatch Metrics Enabled", "severity": "Medium", "description": "Ensure that AWS CloudWatch metrics is enabled for WAFV2 Web ACL rules.", "more_info": "As a security best practice, make sure to enable CloudWatch metrics for all the configured Web ACL rules. These metrics are useful in understanding the access patterns for your web application like allowed, blocked or passed requests based on the rules evaluation.", "service": "wafv2"}, {"checkname": "wafv2InUse", "title": "AWS WAFV2 In Use", "severity": "Medium", "description": "Ensure that AWS Web Application Firewall V2 (WAFV2) is in use to achieve availability and security for AWS-powered web applications.", "more_info": "Using WAF for your web application running in AWS environment can help you against common web-based attacks, SQL injection attacks, DDOS attacks and more.", "service": "wafv2"}, {"checkname": "unusedWorkspaces", "title": "Unused WorkSpaces", "severity": "High", "description": "Ensure that there are no unused AWS WorkSpaces instances available within your AWS account.", "more_info": "An AWS WorkSpaces instance is considered unused if it has 0 known user connections registered within the past 30 days. Remove these instances to avoid unnecessary billing.", "service": "workspaces"}, {"checkname": "workSpacesHealthyInstances", "title": "WorkSpaces Healthy Instances", "severity": "Medium", "description": "Ensures that the AWS WorkSpace have healthy instances.", "more_info": "Amazon WorkSpace should have healthy and running instances to ensure proper connection. The WorkSpace is marked as Unhealthy if response isn’t received from the WorkSpace in a timely manner. When the WorkSpaces instance’s status is unhealthy, it fails to respond to the HealthCheck requests.", "service": "workspaces"}, {"checkname": "workspacesDesiredBundleType", "title": "WorkSpaces Desired Bundle Type", "severity": "Medium", "description": "Ensure that AWS WorkSpaces bundles are of desired types.", "more_info": "A bundle in AWS WorkSpaces defines the hardware and software for AWS WorkSpaces. You can create a WorkSpaces instance using a predefined or custom bundle. Setting a limit to the types that can be used will help you control billing and address internal compliance requirements.", "service": "workspaces"}, {"checkname": "workspacesInstanceCount", "title": "WorkSpaces Instance Count", "severity": "Medium", "description": "Ensure that the number of Amazon WorkSpaces provisioned in your AWS account has not reached set limit.", "more_info": "In order to manage your WorkSpaces compute resources efficiently and prevent unexpected charges on your AWS bill, monitor and configure limits for the maximum number of WorkSpaces instances provisioned within your AWS account.", "service": "workspaces"}, {"checkname": "workspacesIpAccessControl", "title": "Workspaces IP Access Control", "severity": "Medium", "description": "Ensures enforced IP Access Control on Workspaces", "more_info": "Checking the existence of IP Access control on Workspaces and ensuring that no Workspaces are open", "service": "workspaces"}, {"checkname": "workspacesVolumeEncryption", "title": "WorkSpaces Volume Encryption", "severity": "High", "description": "Ensures volume encryption on WorkSpaces for data protection.", "more_info": "AWS WorkSpaces should have volume encryption enabled in order to protect data from unauthorized access.", "service": "workspaces"}, {"checkname": "xrayEncryptionEnabled", "title": "XRay Encryption Enabled", "severity": "High", "description": "Ensures CMK-based encryption is enabled for XRay traces.", "more_info": "AWS XRay supports default encryption based on an AWS-managed KMS key as well as encryption using a customer managed key (CMK). For maximum security, the CMK-based encryption should be used.", "service": "xray"}]